[
    {
        "comment": "they still get you for that 5 bucks...this country is just silly at this point."
    },
    {
        "comment": "They should charge 3$ to have an account max. Lol"
    },
    {
        "comment": "5.75 a month to have an account is a $69 yearly subscription just to have an account even if you're using no electricity...crazy."
    },
    {
        "comment": "Well the power company asking you to pay $5.75 dollars is just dumb but what i wanna know is why are they not paying you for the power your putting into the grid? Like you said you are taking strain of the grid and they can reduce their output right? I guess if your provider is a private company then they be too greedy as already established. But here grid is owned and provided by the goverment so i think they pay us if we provide electricity."
    },
    {
        "comment": "So, I don't have an account 😅"
    },
    {
        "comment": "Now that $5.75/Month is a deal breaker for me since i want to have $0 electricity bill not $5.75/Month"
    },
    {
        "comment": "Hey by the way my delivery charges for electricity is almost 2 times my usage, say I used $66.31 for electric used my delivery charges are $113.33 WTF utility companies are ripping their customers off. I have yet to see the truck that pulls up to my house to drop off my electricity."
    },
    {
        "comment": "5,75 to have an account. Lol.😮"
    },
    {
        "comment": "27:03 Oh man, they only charge you $5.75 a month for the account? My company charges me $20!"
    },
    {
        "comment": "the fact that the electric company still charged you 5.75 a month is both hilarious, and shady af. they should be paying you for the surplus electricity that you fed back into the grid at the end of the year."
    },
    {
        "comment": "AI data centers are using a huge amount of power. So much that Microsoft is paying to have part of Three Mile Island reactivated for their data centers."
    },
    {
        "comment": "That 5.75 is worth it to be connected to the grid,"
    },
    {
        "comment": "$5 a month to \"have an account\" with the only electrical company that supplies your area is just a scam."
    },
    {
        "comment": "5.75$ to be your battery and back up power option,, is a great deal."
    },
    {
        "comment": "The $5.75 charge you claim for \"just having an account\" is misleading. Because, as you freely admit, there are times you still access the main electric grid. Who pays for the maintenance of that grid? The answer is your $5.75 fee. Maintenance to a power grid doesn't just happen when something goes wrong, like during a storm. It's a CONSTANT thing and it's expensive! You have any idea how much linemen (lineworkers?) make? It's substantial. If you truly want a $0 bill, then you have to completely remove yourself from that grid-- which REQUIRES maintenance. But that's not some scam from the electric company. That's just the reality of maintenance."
    },
    {
        "comment": "My gas company charges $24 per month for billing. Only use gas to heat, so, Zero usage From May to Sept, but a 24 dollar bill..."
    },
    {
        "comment": "those 5.75 I guess is the fee to be connected to the network"
    },
    {
        "comment": "The criminals running the electrical and gas grids in my state (WA) charge a basic service charge closer to $20 a month. I have to pay that during the summer even though I only have Gas for my fireplace"
    },
    {
        "comment": "That $5.75 was honest, tho. Useful"
    },
    {
        "comment": "Love the fact that the 5.75 monthly fee makes the anual cost of having an account 69 26:55"
    },
    {
        "comment": "In France, the basic service charge costs 15$ on average....."
    },
    {
        "comment": "hey you didnt need anything from us, but we still want 5.75 from you. Thanks"
    },
    {
        "comment": "In Canada where I live, that $5.75 you're paying every month is well over $100 here. We can use $30 worth of electricity and have a $200+ bill. Plus you're limited to how much power you can put back into the grid. Our local power company is also looking into charging us a few per kW. Can't see it being viable where I live"
    },
    {
        "comment": "You’re paying $5.75 to POWER the power company? They keep and resell that."
    },
    {
        "comment": "It's funny they're charging you $5.75 for having the account when they're probably profiting even more not giving you the full value of what they credit you and what they sell from what you generate at a higher profit more than likely"
    },
    {
        "comment": "My power company charges me > $20 per month just to be connected to the grid. In addition, instead of having energy credit that carries over, they immediately \"buy\" my energy, but only at about 1/5th what they charge me for energy."
    },
    {
        "comment": "CHARGING PEOPLE JUST TO HAVE AN ACCOUNT IS WILD. 💀"
    },
    {
        "comment": "I agree there should be a charge but it shouldn't be a double charge. You either get charged for them to hold the power but you get full value for your power that they sell. Or they pay you fractions of what they sell your power for. Not both. In my state, they had roaming blackouts, so they didn't have enough power, now we help them with their supply issues, and they want to double charge us."
    },
    {
        "comment": "So the power suplier doesnt charge a bigger fee like 10-100 bucks just for maintnence of the greed and the conection to them.That is still cheap"
    },
    {
        "comment": "I assumed that much, since at the very least I vividly recall the water bill saying \"Costo fijo por conexión\", which roughly translates to Fixed Connection Cost. Presumably again, being able to access the service at all has its own costs."
    },
    {
        "comment": "they charge you 5.75 to have the privilege of giving them electricity"
    },
    {
        "comment": "dang electric company salty u pay no bill they have to charge $5, then again it could be worst."
    },
    {
        "comment": "CON (yeah right in the name) ED in NY charges $20/month connection charge and in NYC we can’t have batteries, even the Endphase LFP ones"
    },
    {
        "comment": "Of course they charge $5.75 a month. They can't let you get away with having nice stuff and not have to pay. 😄"
    },
    {
        "comment": "The $5 charge to the provider still makes sense, you're paying to access all of the grid that distributes your electricity that they have to build and maintain, and the skilled operators that have to turn production on and off when you might need it. You're essentially paying to have access to the biggest wall battery of them all."
    },
    {
        "comment": "The power company are a bunch of pirates that is a racket that we need to fix dude I was paying 90 a month for a little efficiency apartment a little studio and I mean little dude when I first moved in here I was paying 35 40 bucks a month and it jumped up to 90 and I didn't change a damn thing no extra use no nothing extra no different crazy now it's going back down again"
    },
    {
        "comment": "$5.75 for account😂"
    },
    {
        "comment": "Just get rid of the account"
    },
    {
        "comment": "27:00 the $5.75 isn’t just to have an account. It’s your fee to be connected to the grid so you get to use it (through net metering) as a huge battery backup by proxy! Not bad for effectively having a backup that’s gigawatt-hours in size!"
    },
    {
        "comment": "That's VERY cheap, I pay €14,02 for the connection + €48,93 network management + €52,10 taxes. That is not yearly but every MONTH."
    },
    {
        "comment": "The power company be like oh you dont use electricity. Slap on this BS $5.75 charge every month just for existing 🤣🤣🤣"
    },
    {
        "comment": "actually a $70/year electric bill is not that bad! I'd still try harder to go off grid with only your high load appliances kept on shore power. but if that $5.75/month is their lowest rate without seeing any or much credit for the surplus power return from your grid tie power that feeds into the meter and you're still paying a balance to the power utility company. then you're better off going off grid. If the power company is still raking more money while using grid tie, I would yank the power meter and cut off the lines from the house and power pole!"
    },
    {
        "comment": "Some power companies charge a flat rate to be connected to the grid. A $0 power bill if you're a Rocky mountain power customer isn't possible"
    },
    {
        "comment": "Problem I would have with the 5.75, is if you end the year with plenty of credit, they should pay you for adding to the grid that year. Banks pay for using your money with interest, say the power company needs to do the same."
    },
    {
        "comment": "Fun fact, in the uk our power companies charge you a daily connection fee, even if you manage a net 0 power fee the electric company still gets to charge you like £30 a month to be connected to the grid. 😅"
    },
    {
        "comment": "up here they charge you minimum 50$ because its not fair for them"
    },
    {
        "comment": "Unfortunately it's illegal to do back charge in Indonesia."
    },
    {
        "comment": "27:00 i am in italy and the cheapest tax for owning an account is 35€ wtf"
    },
    {
        "comment": "$5.75 thanks guys 😂"
    },
    {
        "comment": "charging a $5.75 per month service fee when YOU'RE giving THEM electricity is criminal."
    },
    {
        "comment": "1. Can you cancel your electrical service so you don’t have that $5.85 bill or change providers ? 2. What’s your true up bill at the end of the year for your system usage ?"
    },
    {
        "comment": "What about other electricity provider fees?"
    },
    {
        "comment": "$6.00 is pretty cheap for the accounting, compiling, printing and mailing of your power bill."
    },
    {
        "comment": "I like how your grid company was like \"Marcus won't get away with it! Charge him 5 bucks!\""
    },
    {
        "comment": "Don't pay the 5$ bill , what are they gonna do ? Cut of power 🔋 😂"
    },
    {
        "comment": "a company would charge you just to have an account open, thats crazy LOL awesome video though. So much info"
    },
    {
        "comment": "I wish my power company only charged $5.75 just to be a customer...I'm currently getting raked over the coals for $30 a month...JUST to be a customer. Great video none the less."
    },
    {
        "comment": "Hawaii charges $30/month just to have an account."
    },
    {
        "comment": "Here in New Zealand we are charged a daily rate just to be connected to the grid, so even if you used no power at all in a month you still have to pay a fee. This daily charge can vary anywhere from 30c up to $3 depending on your power provider and plan."
    },
    {
        "comment": "In the Kansas one power company charges a min of $35 a month for the service and they do not pay for extra you put in the grid, In Oklahoma they are the same but $45 a month. Both are Coops. Crazy how everyone wants you to do things like this until it effects there biz. The roof is a great Idea, wish it was around 12 years ago when I did mine. Great job on the math and the details."
    },
    {
        "comment": "Ridiculous! Go with a different provider"
    },
    {
        "comment": "it would be better if they payed you what they charge you or electricity"
    },
    {
        "comment": "@@ReinaldoRauch our grid is effectively nationalised here in the UK, but we still pay a monthly connection fee. Whoever owns it doesn't alter the economics of the situation."
    },
    {
        "comment": "Hahaha 🤣 $6/month to have an account and be connected to grid?!? 🇨🇦 ALBERTA CANADA it’s like $300/mth in administrative BS and ZERO usage"
    },
    {
        "comment": "That sounds all nice. But 😂about all the extra charges the power company charges in administration charges and fees that are tackled to bill each month. It's not all about what you used it's all those bloody extreme charges that make your bills large!?"
    },
    {
        "comment": "only 5,75$ monthly for beeing put to grid? i in Poland have maintenance fee, upgrading grid fee, beeing plugd in fee and some more."
    },
    {
        "comment": "Power company still charge you a fee just to be connected. You never have a zero dollar bill."
    },
    {
        "comment": "How is your baseline just to have a power-utility connection less than 6 bucks per month? Where do you live? I've had power bills in 3 states, and the amount I pay if I use zero kWh in a month has never been less than $30/month; currently, it's $45/month."
    },
    {
        "comment": "$5.75 subscription for an endless battery is kinda neat."
    },
    {
        "comment": "Great video. Thank you. The $5.75 is the price you pay to keep your house connected to their grid in the case you need them."
    },
    {
        "comment": "Are they charging for having a account or is it a \"maintenance fee\"? Here in sweden we pay two diffrent bills, one to the grid owner that we are connected to for maintenance and one from the one we are buying the electricity from for the electricity. as someone living in a apartment i pay more in maintenance fees then i pay for electricity."
    },
    {
        "comment": "Close the Account to get 0$ Bill😅"
    },
    {
        "comment": "$5.75 monthly charge isnt too bad. Its $14.75 for me"
    },
    {
        "comment": "IMPOSSIBLE in Texas as even if you have 0 usage you still have to pay 💰 for “electricity delivery fees from ERCOT”"
    },
    {
        "comment": "Lmao at the 5,75 $"
    },
    {
        "comment": "Those 5.75 sound like taxes to me at that point. The company is probably not federal but if it was, you could have just gotten a refund through tax return."
    },
    {
        "comment": "The \"5 dollar\" bill is justified... Someone has to maintain the grid. Imagine if you were running on the same grid from 100 years ago..."
    },
    {
        "comment": "If you are on grid you're getting a iminium bill in my area $35"
    },
    {
        "comment": "you have to still pay electricity delivery charge and other fees it will never will be 0 dollar bill unless you can sell the excess power."
    },
    {
        "comment": "The $5.75 isn’t just for having an account. It is for using the grid infrastructure even when you aren’t using energy. That number can be much higher. I pay ~$12 per month in WA state. It’s a lot higher in states like California."
    },
    {
        "comment": "Don't you still need to pay the service fee for the electricity bill"
    },
    {
        "comment": "there should be an option to switch the monthly 5.75$ fee to losing a few kilowatts of your minus balance"
    },
    {
        "comment": "Stop $5.75 is called a readiness service charge. So that means they have to provide a certain amount of electricity for everyone. Not just you, and it's built-in that way. That $5 and 75% a month means they have money in coming to keep employees employed. To keep their service, people employed. Start, it's something does happen. They have people to send out now. Do you ever side of the coin is if you don't like pain? That $5.74 close up your account. There's a cost of doing business in every business. This is There's if it bothers, you close your electric account and you don't have to worry about $5.74. And you can wait until you're batteries. Charged back up again, purse is solar to have energy."
    },
    {
        "comment": "I have 9.8kwh and haven't paid for electricity since March... Min service charge is $12.67 which is dumb."
    },
    {
        "comment": "There charging you for putting energy back on the grid😂 your definitely getting ripped off for the $5"
    },
    {
        "comment": "$5.75 a month - That’s a low service charge - in NZ the DAILY charge is rising and we have been warned that it will be over $3 per DAY soon. That means it will be over $1000 a year (USD600) just to be connected."
    },
    {
        "comment": "You are not including the minimum Charge a power company charges to be hooked up to the power grid. In my area that is $29.99 per month."
    },
    {
        "comment": "What about all the fees the provider charges do you still p ay them"
    },
    {
        "comment": "Me: looks at $5.75 bill Me the next day: I would like to close this account please"
    },
    {
        "comment": "$5.75 a month for a power connection seems completely reasonable."
    },
    {
        "comment": "eightsleep charging a subscription ontop of 3k for the topper is criminal"
    },
    {
        "comment": "A $6 admin fee from the service provider every month, I can live with that. A bit unfortunate that you have to ........ Ill give it the comment section.😊"
    },
    {
        "comment": "How much is an interrupted service worth to you? Unplug from the grid set yourself free, it's priceless"
    },
    {
        "comment": "It's not a stupid rule. You are using the grid to stabilize your system, so you should pay for the grid. If you think it's stupid, then why don't you disconnect from the grid? To do that, you'd have to spend a whole bunch of money on batteries and specialized inverter/chargers. Now tell me that's smart?"
    },
    {
        "comment": "That 5.75 fuck you fee from the power company made me literally laugh out loud. Insane."
    },
    {
        "comment": "I mean $5 a month really isn't that big of a deal and it makes sense you are using their equipment the annoying part is even if you doubled your battery to the point where you didn't need to connect to it at all pretty much no matter what you'd still need to pay that because you can't legally disconnect"
    },
    {
        "comment": "Its a good concept but unfortunately the cost to high for most especially in the terrible economy we are in and also some places still charge you a minimum on your pwer bill."
    },
    {
        "comment": "Just adding a charging station at home can run anywhere from 1k-7k depending on your needs and location. There is a lot of hidden costs."
    },
    {
        "comment": "I had read government was offering companies green credits to have chargers at work. Add base board heaters. Start with most expensive things first. Can you offer your charger to others for a fee"
    },
    {
        "comment": "My power company charges $18/mo even when I'm net negative energy usage. $5 sounds great :)"
    },
    {
        "comment": "When the electric company can't charge you for electricity anymore, they'll charge account fees. That is shit"
    },
    {
        "comment": "\"The electric company charges me $5,75 just to have an account. Thanks guys\" Do you have any idea about the infrastructure behind the \"$5,75\" that enables you to take power from the grid on all those nights of air conditioning, charging you car and all those other gray graph lines on your app? So yeah, \"Thanks guys\" is for allowing you to live because even with everything installed on your roof you are still not able to live self-sufficient and need the backup of the power company. $5.75 is really cheap too."
    },
    {
        "comment": "Basic Service charge = B.S. charge"
    },
    {
        "comment": "I call it the \"connection charge\", so just for being connected to the grid you have to pay that amount. Mine is $15 though. My panels are only on the garage part of the house, so when that sheet falls it does it right in the driveway in front of the garage, which is unfortunate."
    },
    {
        "comment": "Are power companies pissed off? The charge you $5.75 just for having an account."
    },
    {
        "comment": "My electric company charges $30 a month just for the privilege of having service, with zero usage."
    },
    {
        "comment": "not that this isn't great, but I'd still pay that $6 for a electricity grid account, never know, maybe if/when the system fails, a backup is nice"
    },
    {
        "comment": "$5.75. They could of made it a dollar. Makes no sense $5.75."
    },
    {
        "comment": "27:15 this fucked they charge when have credit even"
    },
    {
        "comment": "they still get you for that 5 bucks...this country is just silly at this point."
    },
    {
        "comment": "They should charge 3$ to have an account max. Lol"
    },
    {
        "comment": "Did you figure in your SRECs into the payback? And do you have to pay a monthly fee to be connected to the grid like we do here in PA?"
    },
    {
        "comment": "That $5.75 is not \"just to have an account\" it is the fee to be connected to their grid. They maintain the lines to make sure you have the grid electric when you need it, even if you used a credit to pay for that electricity you used from the grid, you still need to pay a connection fee to be on their grid, and they wont allow you to pay that connection fee with credits. You are lucky it is $5.75, I have the same thing in VT but its more like $15.50 a month."
    },
    {
        "comment": "That amount isn't to maintain your account, it is to maintain the electrical infrastructure to your house. Because even if you sell back to the grid you need to use the infrastructure."
    },
    {
        "comment": "That $5.75 account charge is so petty ahahahaha I love it"
    },
    {
        "comment": "My electric company charges $40 per month just to be connected to the grid."
    },
    {
        "comment": "It beats the $100+ SDG&E will be charging just to have an account."
    },
    {
        "comment": "I think the $5.75 is to pay for the cost of having the power cable plugged in on their side and doing paperwork and maintaining various parts of the grid that move the electricity and don't actually make it, e.g. power lines and transformers. Which is really really cheap considering how much transformers and power lines you get on average per house. Also, thanks for checking your units, all the dimensional analysis checks out!"
    },
    {
        "comment": "So your electric company still charges you around $80 to $90 a year for basically still having an account. That gives a whole new heights to capitalism."
    },
    {
        "comment": "Power company reselling your power and charging 5.95 a month to do it? wtf... I'd just get more arrays and batteries and cut their ass off."
    },
    {
        "comment": "So, do you get some money back from the electric company as it generates power back to the grid? Oh and that 5.75 fee at the end of your bill is a joke. If you're giving them back power, you should be at zero without a doubt. Account fee my booty, companies always have to get a piece of the pie. uff"
    },
    {
        "comment": "Don't forget that depending on what market type exists where you live, you may be required to pay just for being hooked up to the grid. It's a baseline charge transmission companies have. Meaning you have to actually over generate in order to not pay anything."
    },
    {
        "comment": "Well 5,75$ a month to know that you have the grid as a backup it's too bad"
    },
    {
        "comment": "the fact that they still charge you even if you dont use any electicity makes me sick. You should charge them for charging you lol"
    },
    {
        "comment": "$5.75 a month to have grid backup aint bad at all"
    },
    {
        "comment": "Why not open your charger up to the public for income"
    },
    {
        "comment": "New to the channel, and now subscribed! Thanks for the detailed descriptions and candor about costs. For some perspective, here in central Oregon I pay a $28 \"Facilities Charge\" to my grid as opposed to your $5.75. Can't wait for the next video."
    },
    {
        "comment": "Great video, I've been curious about this. Not that I could afford to do it, but it is cool. That being said, seeing your $5.75 a month charge makes me sad, it's $45 for me :("
    },
    {
        "comment": "It's not $5.75 \"just to have an account\", it's for them to be providing YOU a backup to draw on. The fact that you net-zero use is nice and all... but there's a bunch of months where they loan you power to make up for not being able to make enough power during the winter. You are paying for that feature, for the lines, etc."
    },
    {
        "comment": "yeah that $5.75 is half what Entergy charges here in Texas, they pull $10/month as if its a membership fee o.o"
    },
    {
        "comment": "also you'd think they'd waive that 5.75 per month since they're technically your customer too"
    },
    {
        "comment": "I love this, seeing the numbers of everything is the info I enjoy looking at but considering my usage is very low and my bill is usually around $20 a month I'll just stick to the grid for now."
    },
    {
        "comment": "Aren't you always building negative kwh??? isn't that enough to keep the account open? why does there need to be a charge. It is 6$ but i don't see why you should pay that at all."
    },
    {
        "comment": "Lucky you don't have SRP in Phoenix. The basic service fee is $32.44 So even if I could zero out my bill, there's that. Also, they fix their rates so no matter the plan, they will get some money. If they charge you the same rates for on and off-peak, they hit you with a demand charge (greatest usage during on-peak) at a ridiculous rate. If you pick the no demand charge plan, they charge a normal off-peak rate, a high on-peak rate, but pay you a ridiculously small rate for what you push back to the grid."
    },
    {
        "comment": "The 5.75 charge monthly is still not bad at all for having the power company as a backup in case all else fails and just maintaining that service. No one unless they are completely off the grid and self sufficiently living, can say they have a $0/mo in their household bills. Love this video! So much detail. You said numbers and graphs and I groaned. But it was easy to understand!!"
    },
    {
        "comment": "The $5 per month to the utility company covers more than having an account. They accept the excess power when your panels output more than your batteries can accept, they supply power when your batteries and panels cannot. They still have to maintain all of the power infrastructure in your area to allow that."
    },
    {
        "comment": "Why pay the $5 for the account, if you don’t need it then ? or was that just for data, for the video…"
    },
    {
        "comment": "wait so power companies don't have to pay you or eliminate that $5.75 fee with all the credits that you have with them?"
    },
    {
        "comment": "5.75 is better than 13.75 to just have an account with NV energy"
    },
    {
        "comment": "Thank you for the great video. I'm not sure whether you're complaining about the $5.75 bill from the company or not - but according to your explanations, you seem to be very lucky. I know that certain providers charge way more for the electricity they provide than for whatever electricity you feed to the grid; so you might need to feed 10 kWh into the grid in order to use 7,5 kWh for a net $0. Some others charge way more as \"grid and transmission\"-fees. In many cases, these utility companies have monopolies, so you've got to take whatever fees and rates they charge, so honestly, I think you've got yourself a very sweet deal: hardly paying anything and still getting electricity from the grid whenever you need some..."
    },
    {
        "comment": "Unpopular opinion but its not fair to your neighbors to use the grid, put wear and tear on it, but pay $0. The cost will be put onto the neighbors who are not fortunate enough to get a system big enough to offset their grid use. I think there should be a nominal fee still assessed each month for users like you. just to cover maintenance and such. Im talking like $15-$20 tops. Thoughts?"
    },
    {
        "comment": "Interesting I would counter their monthly bill with one for them to be connected with you... the same amount of course"
    },
    {
        "comment": "The 5.75 power bill isn't just to have an account, it's' to live in a society. The electrical grid is important to us all, just like public school are important to us all. And just like even if you don't have kids you still benefit from public schools, you still benefit from the power grid even if it's not powering your home."
    },
    {
        "comment": "Honestly, $5.75 monthly for a backup option of a regional grid sounds like a deal."
    },
    {
        "comment": "I laughed when you mentioned that you paid $5.75 just to keep the account open"
    },
    {
        "comment": "I pay $30 a month \"just to have an account\" despite no usage through most of the year."
    },
    {
        "comment": "The $5.75 a month is because you're attached to the grid at all - it's a very complicated and costly thing to maintain. The amount of engineering and thought that goes in to *safely* distributing electricity, accepting the electricity that you produce, and providing it to you when you need it is truly staggering. It's easy to get caught up in thinking that power is just power and it's as transferable as liquid, but nothing could be further from the truth - the exact frequency, amperage, and switching logic all has to be planned and managed for. So, yes, you pay $5.75 to the utility that does all this for you on the back end."
    },
    {
        "comment": "The $5.75 is to pay for servers and security and management of the account system. So it kinda makes sense if you think about it."
    },
    {
        "comment": "5.75 to give them power bulllshit"
    },
    {
        "comment": "Amazing! If only electric power providers/distributers thought about not charging money for an account....what's even the point for it?"
    },
    {
        "comment": "In NY the stupid service charge is 15-25 a month depending on your usage. I wish it were only 5 here"
    },
    {
        "comment": "The fact they charge you $5.75 after taking your excess energy 😂"
    },
    {
        "comment": "I've seen a couple people mention that the $5.75 bill to the electrical company is unfair but that price is extremely reasonable considering MKB gets to pull from the grid when he needs to and sells back to the grid his excess. The infrastructure to do that is only available because of the electrical company and being able to access that support network is worth way more than the literal value of the electricity he sells."
    },
    {
        "comment": "My electricity bill is like $13.50 because the power company charges so many fees just to have an account. Also it’s illegal here to not be connected to the power grid if you have access to it. So you gotta pay every month to just exist :("
    },
    {
        "comment": "$5.75 service availability charge isn't bad. Mine is $35!"
    },
    {
        "comment": "5.75 just to have an account... I have all bills included but my dad says they charge him 95 pounds to just have an account... power companies are horrible"
    },
    {
        "comment": "My minimum to have an account where I live in Florida is 31 dollars (up from 9 dollars 6 years ago)."
    },
    {
        "comment": "Honestly, that small charge is fine if the electric company is using it to maintain the grid."
    },
    {
        "comment": "Awesome video - very well explained. The 5.75 for just having an account is some real.... American capitalism to say the least."
    },
    {
        "comment": "How silly they are charging that $5.75 lmao"
    },
    {
        "comment": "the 5.75 are for people in the grid maintaining it. they need salary."
    },
    {
        "comment": "$5.75 is that not for the privilege of being connected to the grind… what about finance cost of $92,000 ? Was that in the 9.6 yr payback?"
    },
    {
        "comment": "That $5.75 pisses me off honestly. You didn't mention whether they pay out your remaining negative balance at the end of the year, but it sounds like no. Which means they are charging you to make electricity for their benefit. This country is a joke."
    },
    {
        "comment": "You should really find out about that 5 dollar charge...sounds illegal, and if you let it slide, your hurting everyone else. If you give them an inch they will take 10 miles. Then they will try to pass a bill in there favor. And we will be back to the right to repair problem."
    },
    {
        "comment": "For your #2 point, if I understand correctly, either you have an electricity provider, and you pay like you said, but can you choose to not subscribe to anybody (and taking the risk when your batteries are empty)?"
    },
    {
        "comment": "lol they are getting electricity for free from you and still charge you $6. Here the providers have to pay you for what you put into the grid."
    },
    {
        "comment": "5-6$ for a backup powers source seams fine even though they did ruin the potential of a beautiful numbered bill. I'd imagine most people don't mind even though with all that credit you likely earn them more than that just existing."
    },
    {
        "comment": "In Australia, the daily charge is much more, I think ours is around $60AUD per month…"
    },
    {
        "comment": "In colorado they charge 7.7 cents per kwh which is super cheap. but they also charge like 30 cents a day just to have an account. I forget the ammount, but it's 10-15 bucks a month just to have an account. So it's great if you use a TON of electricity. it's bad if you use very little. They also have tiers, so the more you use the price does increase."
    },
    {
        "comment": "The power company charging $5 a month is just rude."
    },
    {
        "comment": "My power company's service fee is $15/mo in NC. No battery, but my power bill is usually just the $15, even when charging my Bolt daily."
    },
    {
        "comment": "So it sounds like during 3 out of the 4 seasons you can just go completely off grid, that sounds like a pretty good deal"
    },
    {
        "comment": "Get another battery and tell electric company to shove that 5.75"
    },
    {
        "comment": "So you're running a setup still connected to the grid, sorry If I missed you mentioning it, but how much do you pay just for the connection (not usage)? The connection fee just to be connected to the grid is almost 40% of my whole power bill each year, I imagine with a setup like yours that cost wouldn't be 0? Or are you backfeeding enough into the grid during summer to pay for it? Our summer backpay rates selling to the grid are almost 1/10th what it costs to buy power from the grid, so it's incredibly inefficient way to cover the connection costs."
    },
    {
        "comment": "Yea the connection charge is what I was thinking though the entire video, here in Aus we are charged a daily fee for it so you are lucky its only $5, my connection fee is about a dollar a day making it $90 ish over the quarter."
    },
    {
        "comment": "It doesn’t go backwards they have two separate section one goes one way and the other one goes the other and they take the one away from the other. And I still have a billing fee so it’s not totally free. I live in Arizona which pretty much pays for everything and I have three air conditioners so I have a lot of power running at my place so I have a lot of Solar. And if one little part of the system goes down because of everything that I have I end up with a small electric bill was that doesn’t upset me but they do charge me a billing fee which is 31 and $32 a month just for the billing fee that used to be 27 but it went up."
    },
    {
        "comment": "The electric company charging 5 bucks a month for literally no reason is some bull$hit. Should sue them."
    },
    {
        "comment": "$40 service charge here in arizona."
    },
    {
        "comment": "$6/month to use their entire grid of power when needed seems like a pretty good deal if you ask me."
    },
    {
        "comment": "In FL, we have around $30 connection charge even if you don’t use any power from the grid. It used to be $15-18 but a new law penalizes you for not using enough and you get up to $30 connection charge 😢"
    },
    {
        "comment": "5.75 to have an account is CHEAP. Here its $70 a month"
    },
    {
        "comment": "Awesome vid Marques. Super happy you are in the North East (I'm in Ottawa, Ontario), and the snow thing was the thing that was really holding me back. The way the snow dumps is actually very interesting. We often get 30cm snow dumps onto the roofs, so having that slide off would be something to think about further. I think your Hydro company is a lot more user friendly than mine. I don't believe they have a system for Net Zero metering and I believe they removed the credit system, so... ya that sucks. Charging you $5.75 is pretty lame for having an account. I'd switch to paper billing just so they have to pay for a stamp to mail me out an invoice. Yes, I'm bitter like that."
    },
    {
        "comment": "to be fair less than $6 a month to track all your ins and outs from the grid and generate the bill is quite reasonable."
    },
    {
        "comment": "Yeah. Base charges suck. It’s basically a subscription to have access to utilities."
    },
    {
        "comment": "Thats crazy theyre charging you 6 bucks a month to sell them power 😂"
    },
    {
        "comment": "$5.75 is great we pay $27 with 0 usage 😢"
    },
    {
        "comment": "The electricity provider really charging you 5.75 a month for them to get free electricity"
    },
    {
        "comment": "Living in Sweden in my efficient home with district heating, I use 1/8 the electricity per year and I drive an electric car as well. Sometimes American homes are just whack. However my fucking power company charges $75 per month fixed price just for the grid connection. The actual power usage which I buy on the market is about the same or less."
    },
    {
        "comment": "Actually the 5 dollars per month you pay because you actually used the grid"
    },
    {
        "comment": "The 5.75$ are for you need the grid in the night or to charge your car."
    },
    {
        "comment": "That $5 monthly account charge is actually pretty good! My power company in Ontario Canada has a monthly $50 delivery charge regardless of usage. In theory that’s paying for system upgrades, and keeps the per-hour charges lower but it disincentives a system like yours because even at 0kwh of usage the bill is still $50. Unless you can can go fully off the grid… but that’s a step too far for most of us."
    },
    {
        "comment": "5.75 is not bad. I am paying 13.45 for the same reason..."
    },
    {
        "comment": "I live in your area, and the \"power delivery\" is probably 30-40% of my power bill. I'd imagine, unless you're providing enough power to offset this, you'd still get charged for it, no?"
    },
    {
        "comment": "Nice setup! I wish my hydro company charged only $5. I’ve been overproducing for the last few months and the lowest I can get my bill is $35 because of the “admin fees”"
    },
    {
        "comment": "What about the distribution cost? The distributor needs money to setup for infrastructure right? So even if you don't draw anything from the grid, wont they charge some for distribution?"
    },
    {
        "comment": "power company: hey, just cuz you have an account. by the way we wont allow you to cancel it laws and such, you owe us somthing. you cant fight it or we will cut, i mean charge you a late fee."
    },
    {
        "comment": "The $5.75/month is to pay for the grid infrastructure. Sounds like a bargain."
    },
    {
        "comment": "😂 The $5.75 a month just for having an account is wild."
    },
    {
        "comment": "Marques - I'd love to see you scale this to an industrial/business setting. I've investigated this for my business and found it not at all worth it. Because I have heavy machinery, ConEd charges \"demand charges\" in the hundreds of dollars in addition to my usage. This demand charge is DOUBLE my usage charge (they're killing me just to have the ability to accommodate for the energy spike when I turn compressors on). My usage will often be $200, while my demand charge will be a small business-killing $300-$500. I'd like to see someone with your tools investigate this and expose ConEd"
    },
    {
        "comment": "Your $5.75US monthly account charge is cheap, In Australia we have a daily service charge of about $1.40 or $42AUD a month/$504yr ($28.17USD/$338yr)"
    },
    {
        "comment": "The electricity company don't charge you just to have an account. Relaying in the grid for providing energy in case you don't produce enough energy has a cost to the system. This cost would be paid by others if you don't pay an extra network cost even if you have net zero or excess energy produced by your own house."
    },
    {
        "comment": "Utility bill still charge you a minimum fee regardless you use it or not."
    },
    {
        "comment": "Dude, you're lucky. My electric provider capped me at a 10kw system and I have a $34.50 connection charge so I can't even get close to your $5.75 bill."
    },
    {
        "comment": "U have a good electricity company ,ours im canada will charge u crazy rates for delivery and other fees as long as they provide u power u will pay those charges"
    },
    {
        "comment": "Unfortunately/fortunately being completely off-grid as a primary residence in any sort of populated area is pretty much not allowed in the US thanks to a mix of local/state/municipal rules and NERC. Maintaining grid infrastructure costs money, so it's a lot like telephone lines. Somehow money has to come in the system somehow, and rate-payers is the easiest way. I know here in Florida there's been a lot of politics around the 'minimum fee'. Two different utilities in 2023 charge a minimum of $25 and $30 a month. Of course we have extreme conditions with Hurricanes to contend with."
    },
    {
        "comment": "My questation is havent u been paying delivery charges and other fees because those tend to be more than the cost of electricity itself"
    },
    {
        "comment": "So just a little side note..they charge 5.75 a MONTH just to have an account..there's 9.23 million people just in NJ..so they make $646 million dollars a year just for people having an account...holy shit!!!"
    },
    {
        "comment": "that $5.75 charge is peanuts. Here in canada, we pay a flat fee of $30-40/month regardless of whether you consume any electricity from the grid. Then any usage is calculated per kwh on top of that flat fee."
    },
    {
        "comment": "That basic service charge pays for the grid maintenance, its actually a good thing that its a seperate charge as it keeps the total cost pretty equal for everyone vs when it gets packed into the kw/h price."
    },
    {
        "comment": "$5.75 to \"have an account\" includes tracking the net flow of energy to your property, generating monthly reports of your energy purchases/sales, maintaining the physical infrastructure from the grid to the meter on your property, providing you access to a market where you can sell your surplus energy..."
    },
    {
        "comment": "Hahahahahah, that $5.75 is so petty. It's just like in Hardspace: Shipbreaker they show you your debt (in Billions) and the last row is \"Displaying debt report: $5.00\""
    },
    {
        "comment": "5,75 service charge is nothing we have around 50-80 in various service charges in Greece"
    },
    {
        "comment": "The $5.75 would be the price for being connected to the grid. In theory this would be to pay for grid maintenance grid maintenance."
    },
    {
        "comment": "in NJ, yes, $5.75 / month according to the video; other jurisdictions will vary. If you put on an even bigger system such that it could power everything in the lowest generating 3 winter months you could disconnect from the grid entirely (altho you would have wasted capacity in other months). Also get a more efficient a/c unit to reduce demand Virtual Power Plants are rolling out - they would eliminate this nuisance charge and you would get paid for your helping the grid in times of need. Why is it that companies think they can charge us a fee for having an account, every month? We, as Customers, should adopt this \"pay for every little thing\" model and levy a fee every time we pay a bill! :). Starting at $5.75 / month..."
    },
    {
        "comment": "VERRY MISLEADING on the $5.75 charge for “just having an account.” It costs the power company over $100 per month just to keep lines and generators “on-line” to provide your power at night and on cloudy days. Your neighbors are paying an extra $95 to cover the portion you are now avoiding by getting the “net-metering” subsidy."
    },
    {
        "comment": "More than $5 a month to contribute back to your strained infrastructure. FOH. This stuff needs to be regulated to the ground in the consumer’s favor."
    },
    {
        "comment": "The 5.75 is not an account fee. It's the cost in order to be connected to the grid and to support the cost of the infrastructure to build the service to your home."
    },
    {
        "comment": "Damn your meter fee odd only 5.75? Mine is $20 a month"
    },
    {
        "comment": "So, the 5.75$ are they your part of supporting the maintenance of the electricity grid, which you are actually using?"
    },
    {
        "comment": "Not the $5.75 service charge 😭😭😭"
    },
    {
        "comment": "at least it's not as bad as some utilities which have >$20 monthly account maintenance fees, plus bullsht \"community benefit fees\" that go towards people who don't pay their bills"
    },
    {
        "comment": "To be brutally honest. I think the base fee for the electric connection is fair. They would be much happier if you could sell back the battery capacity in the evening to offset duck curve"
    },
    {
        "comment": "Sounds good but it’s never $0, in Florida by law you can’t disconnect your home from the grid, and they will always charge fees even if you don’t use their services from $17 up to $50. 🤌🏽"
    },
    {
        "comment": "Electric utilities are going to start screwing everyone over for a lot more than $5.75 a month. Great review."
    },
    {
        "comment": "5 bucks is for grid maintenence, like the caules instalation and fixing etc"
    },
    {
        "comment": "I think that $5.75 is to cover line maintenance. Even with your set up you still depend on your utility's infrastructure . Infrastructure requires maintenance."
    },
    {
        "comment": "Alls they will do is regulate it in the future to learn how to charge you for it"
    },
    {
        "comment": "Yes, you should be charged a monthly fee and it should be higher because maintenance of the grid cost money and you’re benefiting from being connected to the grid."
    },
    {
        "comment": "$6 a month for just having an account. What a scam lol"
    },
    {
        "comment": "Would love to have a $5 minimum charge. My utility charges more than $20 as basic minimum charge even if you use no electricity or go negative."
    },
    {
        "comment": "So they can’t charge you a penny to keep the account open?"
    },
    {
        "comment": "Since you provide power back to grid, you can charge back $5.75 😂"
    },
    {
        "comment": "I'm charging you 5.75 for being a sub."
    },
    {
        "comment": "8 months to intall is crazy 🤣 cost $93000 !!! STILL NEEDS ~7% GRID USE 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣"
    },
    {
        "comment": "That $5.75 is basically a subscription for the account XD"
    },
    {
        "comment": "Do you get charged \"delivery charges\" by the way? Cz sometimes my power bill is less than delivery charges."
    },
    {
        "comment": "The 5.75$ charge is rediculus"
    },
    {
        "comment": "My grid provider requires a $16/month fee. It jumped up from around $5 a year or so ago. Still, we are all electric, and it has saved us a ton of money in the winter."
    },
    {
        "comment": "I was waiting for someone to FINALLY Mention the Electric Utility Account Price. Nobody truly pays $0 a Month. Unless you can get paid to sell back to the grid."
    },
    {
        "comment": "Great presentation. I'm down in Tucson, and god knows what the HOA would allow, even if I could afford it. As for the $5.75, it costs the power company to maintain you on the grid, whether you're using their product or not. Consider it a connection fee, and stop griping. Take a good look at your phone bill."
    },
    {
        "comment": "$5.75 base fee is pretty good. In New Orleans the best I can do is a $35 bill by the time they finish all of their charges on a net negative month."
    },
    {
        "comment": "I think the power company charging you despite being net 0, should be thr norm. You are still connected to them and the lines require manitenance and that still costs money and should be fair for them to charge users"
    },
    {
        "comment": "I would consider that $5.75 he mentioned a connection charge and I'm kind of surprised it's not higher. The grid still has to do real work of making sure his connection to it is reliable so it'd be unfair to expect a freebie."
    },
    {
        "comment": "The 5.75 charge is because you’re still connected to the grid … it’s a connection fee when you don’t use power at all."
    },
    {
        "comment": "5.75 dollars for a account 😂😂😂😂😂😂"
    },
    {
        "comment": "That 5.75 is an account maintenance fee 😂"
    },
    {
        "comment": "If you are connected to the grid there should be a connection fee.."
    },
    {
        "comment": "Hawaii charges $8/month just to be connected. It’s nice to have a backup for a few dollars. Less than a music streaming service"
    },
    {
        "comment": "I’m jealous of your $5.75 in Florida our account fee is $25. So we use no electricity but have to pay $25 a month just to be hooked up to the grid, that by law you have to be hooked up in Florida"
    },
    {
        "comment": "$5.75/month account charge is actually really cheap compared to many places. The cost of maintaining the grid is considerable, so a modest account interconnect fee - regardless of account kW/h credits - makes a lot of sense from a utility company cashflow management perspective."
    },
    {
        "comment": "$5.75. just to have an account, wow, that's hella greasy."
    },
    {
        "comment": "They charge 5.75 a month to maintain a miles of lines from the source of power to your house. $5.75 is a deal. The transmission costs way more than the generation for them. If everyone had a $0 bill there would be no power lines for anyone."
    },
    {
        "comment": "It's not surprising that there is a minimum charge from the electric utility. They still have to maintain the grid, so that it's available if you need it."
    },
    {
        "comment": "Don't electricity supply companies charge minimum delivery $$ anyway? I am surprised it is only $5 for your provider."
    },
    {
        "comment": "$5.75 is the connection to the grid, not just having an account, this is the case for all power providers and pretty much all the world"
    },
    {
        "comment": "The 5.75 isnt just for having an account, they are providing infrastructure and a service for you to be connected to the grid"
    },
    {
        "comment": "I’m with Nationwide."
    },
    {
        "comment": "@@steveno7058 fair enough. I don't think $5 is really supporting the grid"
    },
    {
        "comment": "Did your billing energy company not charge you all the associated fees?"
    },
    {
        "comment": "$5.75 is more then a fair deal. considering you are not truly of the grid and the electricity grid is the most critical infrastructure.. everyone has to pay for it"
    },
    {
        "comment": "Dope, how's the monthly payment on the loan for the equipment? Does it still offset the price from drawing from the grid?"
    },
    {
        "comment": "We are required to use a duplex connector to our grid whether we use net metering or a battery storage option. Our regulators have determined that we must be connected to the grid and that the power company (FPL) is entitled to a $35/mo fee for any customer on the grid. Yes, $35/mo is trivial, to eliminate a monthly electric bill quite reasonably over $200 a month, but it's a thought when we talk about home storage and connectivity hardware."
    },
    {
        "comment": "$5.75 per month power insurance - totally worth it."
    },
    {
        "comment": "That 5.75 charge is so petty by the company 😂"
    },
    {
        "comment": "Ok, that $5.75 is just petty."
    },
    {
        "comment": "I honestly think that $5.75/mo is very reasonable. They are providing you the net metering service, they are giving you a backup in case something goes wrong, and they need to maintain all those servers, data centres, power grid, power equipment, and generation stations. It's cheaper than Netflix for such an essential service, it's quite fair I'd say."
    },
    {
        "comment": "It is not $5 to keep your account open, it is the cost of keeping you connected (distribution lines, etc.). In fact, it most likely costs more than $5, but the \"why\" is a much longer story."
    },
    {
        "comment": "5.75 isn’t really that bad tho."
    },
    {
        "comment": "They charge a minimum just to have an account because it costs to maintain the infrastructure so you can use power from them instantly when you need it"
    },
    {
        "comment": "Honestly the $5.75/mo is pretty fair. You’re connected to the grid, and the grid has maintenance costs that you should pay into. You’re paying to not have your power cut in the winter on those cloudy days."
    },
    {
        "comment": "Another way of looking at the $5 monthly utility connection charge, is that you are paying for the additional reliability of being connected to the grid. Some of the time you are pulling from the grid and using it sell back electricity that gets distributed to your neighbors. The grid has cost billions of dollars to construct and maintain so $5 is probably a pretty good deal."
    },
    {
        "comment": "our \"connection to the grid\" fee in NC is close to $18 after all other fees. meaning my lowest electrical bill, even when i'm adding more than i'm using, is roughly $18...."
    },
    {
        "comment": "The power company charges you that $5.75 monthly to provide your home backup power when you need to draw from the grid. That’s cheap. As you know, disconnect from the grid and that service charge goes away."
    },
    {
        "comment": "$5 is what i pay for my studio electricity in a month"
    },
    {
        "comment": "A monthly standing charge of $5.75 is pretty good. I'm paying the equivalent of about $22 pm in the UK."
    },
    {
        "comment": "$5.75 a month is just a money grab for the utility....just think...if they raise the cost 1 dollar times the millions of customers, that's a instant monthly profit of millions just like that....they will hide it in some other cost to evade the watchdog groups but nonetheless, they will get free money....great video"
    },
    {
        "comment": "$5.75, well they ARE providing a service, so they deserve that much!"
    },
    {
        "comment": "$5.75 they just won't let you get that zero. Very interesting, thanks Marques."
    },
    {
        "comment": "Just a quick note on the standing charge of $5.75. That has to cover maintenance of the grid in the event you do need to take from the grid. That charge will be going up everywhere as grids need to be upgraded as more microgeneration puts it under stress. On sunny days imagine the grid has to deal with lots of energy coming into the network that was never designed to handle it. Try and think of that charge as a grid access pass and grid maintenance fee."
    },
    {
        "comment": "I don't mine the $5.75 honestly. I've been thinking that even if every house could sustain itself, having the grid around would be useful for emergencies and sharing excess power."
    },
    {
        "comment": "Charging you a minimum. You must have electricity from PSE&G then. I have them on Long Island and they never cease to find ways to rip me off."
    },
    {
        "comment": "That $5.75 membership fee is a scam. That company should be ashamed"
    },
    {
        "comment": "My electric company charge you to have an account with them, sounds like a little loophole even though being a customer to any electric company is already generating them a profit."
    },
    {
        "comment": "Basic service charge is the payment for the grid infrastructure , like the wires and the poles and the power station."
    },
    {
        "comment": "So your power company basically has a subscription fee, that must be nice right? /s"
    },
    {
        "comment": "imagine getting charged 5.75$ a month for just having an account, i love america"
    },
    {
        "comment": "Is there no connection fee to the grid in NJ?"
    },
    {
        "comment": "Ok, the $5.75 is not just to have an account. It's to contribute to cover the costs of keeping the line to your house. You can spin that how you want, but the fewer people using power consistently lowers the amount money for the company. Yes, they are protecting profits as well, but ultimately people pay for the high power lines that carry from the power source (coal/nuclear/gas/solar/wind plant) to distribution station(s) to houses."
    },
    {
        "comment": "Good content and super clear presentation. One comment and one question: 1. Your $5.75 monthly charge on your bill probably also incorporates a fixed fee representing your portion of the costs to support and maintain the utility company's local grid infrastructure. The utility company MUST charge you this fee as long as you are tied into the electrical grid, as it would be unfair (and thus unlawful) for other grid users to pick-up your share of costs to support the grid. Multiply this policy out over thousands of other grid users similar to yourself and you can see why this is the case. 2. Are you participating in a Tesla virtual grid or \"auto-bidder\" program. I'd be curious how the auto-bidder software could positively impact the KwH you generate and sell back to the grid."
    },
    {
        "comment": "Thats an insane amount of electrical usage. I dont know how much space you are cooling but that 9k annual electric bill is what a small building in NYC would pay a year. Also, the $x to have an account, technically is to maintain the connection when you need to pull from the grid. They need to maintain your meter and monitor it."
    },
    {
        "comment": "Hey Marques, probably the 5,75 charge is from maintain the infrastructure of energy transmission(I think it is from government, but the company probably pay something to them). Based on your graphics, are your air conditioning inverters? I saw a lot of peaks on the graphics, and, as far as I know, this is the air conditioning starting and turning off to maintain the temperature. And the inverter technology(on air conditioning) instead of it, just go to a low consumption and this maintain the temperature without this peaks, this is a economy on around 60%.(like I said, I don't know if you already have this, but for the graphics, I think is not the case). Nice video, when this get cheaper will be revolutionary, like all things Musk do."
    },
    {
        "comment": "Those extra 4 cents may be too much for me"
    },
    {
        "comment": "$5.75 connection fee ? We can go off grid in AUS and we’re paying $200 connection fee"
    },
    {
        "comment": "that 5.75 ruined it lmao they really need money"
    },
    {
        "comment": "I mean... You pay 5.75 to have access to a grid, not just an account. The wires between generation and your house cost money and require upkeep. It's like insurance except you are using it every winter."
    },
    {
        "comment": "This is very interesting thank you. Two questions, where I live I am billed for energy used but also charged a \"delivery fee\" by another company. When you do use the grid does your $5.75 go up based on the \"delivery\"? Could you install a generator that feeds the Power Wall, when needed, vs being connected to the grid at all? Based on your numbers it might be worth a generator to eliminate the grid altogether. My next door neighbor has as Genset run on natural gas that takes over during brownouts here in Texas."
    },
    {
        "comment": "To be fair, the basic service charge might be intended for grid maintenance, which you'd probably still want to be contributing to as you do technically still use the grid, even if most often by putting your excess into the grid rather than pulling from it."
    },
    {
        "comment": "Was leasing vs buying an option? With leasing you get better support when issue occur. Because they need to keep your system working to profit so there is an incentive"
    },
    {
        "comment": "$5/month is a pretty good service charge. Here in Oz, it's about $1/day before any usage. What happens to your excess net negative energy consumption? Don't you get paid for what you're supplying to the grid?"
    },
    {
        "comment": "That’s life, you pay just to exist. I am sure the power company makes enough from everyone else to not charge the account existence fee."
    },
    {
        "comment": "5.75 for nothing is crazy😂"
    },
    {
        "comment": "Even if it's not 100% perfect, the peace of mind and having that $0 electricity bill will help significantly. That is BS that your power company charged you $5.75 just to have an open account. That'd be like encouragement to close the account."
    },
    {
        "comment": "Damn, I wish we had a $5 fee. Our Provider has a $20 monthly service fee. So we paid $240.43 for 2022. So we went over $0.43, but we got a $60 check for high peak that went back to the grid."
    },
    {
        "comment": "Nice! I'm still paying connection fees too but still worth it for using the grid as a back up! I did the Will Prowse low cost version but I'm glued to the data as well! Good to see you excited as I am about this tech!"
    },
    {
        "comment": "Honestly, $5.75 to be connected to the power grid is super reasonable. The power grid is quite amazing"
    },
    {
        "comment": "Also the power providers also charge around $1 per day as a service charge."
    },
    {
        "comment": "Can you change power delivery companies to get rid of that 5$ annoyance?"
    },
    {
        "comment": "Thankyou for not using our service, please pay us 6$ per month anyway..."
    },
    {
        "comment": "$5.75 per month for your connection to the power network? WOW that is cheap i pay $1.33 A DAY just for the connection and 31.724c per kWh (my last 92 day bill was $689.64) getting to the point is becoming a choice power or food"
    },
    {
        "comment": "That $5.75 is a standing charge which is for providing the service."
    },
    {
        "comment": "Lol imagine charging 5.75 for having an account. Scamming millions of people 🤷‍♂️"
    },
    {
        "comment": "$6 per month for \"just to have an account\" (and the trivial tiny thing of having power input when you actually need it - like during winter when all people consume and less people produce) is actually EXTREMELY cheap. \"ruined it\" my ass."
    },
    {
        "comment": "The basic charge is for grid maintenance- which you are still connected to an using, and will probably increase as utility companies see more people doing this"
    },
    {
        "comment": "Seems like that 5.75 charge per month is pretty fair, as you are using the grid. So a minor charge for administration isn't too bad. Both sides see benefits."
    },
    {
        "comment": "$5.75 to pay each month to have account. I wish I could pay that. In UK we pay \"daily charge\"...yes rip off charge. even if you use 0 electricity you pay £300 a year every year for just having meter.... so yeah I wish I could pay $5.75 a month instead of £300 a year on top of my electricity bill"
    },
    {
        "comment": "Your 5 dollar bill for having an gris account is actually quite low for the service it provides. It gives you a grid connection and covers for seasonality. Especially in winter you would need to have a 100x tesla wall to cover for these months usage yourself (please calculate the exact number if you do a second video). Very interesting video! Hopefully it inspires many others too."
    },
    {
        "comment": "Isn’t the 5,75$ monthly charge to maintain the grid rather than just having an account?"
    },
    {
        "comment": "The five dollars per mont ‘just to have an account’ seem more than fair considering how mich you’d have to pay to be actually off grid and do not require their services of taking excess energy of you hand and providing it later."
    },
    {
        "comment": "Maintaining the grid is not free. So, even if you have 0 net elecrricity bill, the company has to still maintain the grid. That's why you have to pay 5.75 dollars to have an account with them. Its a tax of sorts."
    },
    {
        "comment": "What's your service charge per day? Mine is going to $1.52 a day in Victoria."
    },
    {
        "comment": "The small fee you pay each month despite using no electricity would mostly be from the privilege and maintenance coats associated with being connected to the grid to begin with. Gotta pay for repairs and upgrades somehow"
    },
    {
        "comment": "My utility company charges 50-150 depending on how they feel as a delivery charge lol and when it’s comercial it is always double of what you use, I’ve had billed for 1250 usage and 1250 delivery charge. It’s awful."
    },
    {
        "comment": "The $5.75 may be what utilities call a connection charge."
    },
    {
        "comment": "bro 5.75 😂 how usa can do that ?"
    },
    {
        "comment": "Given that you supply the grid with your excess power. You are their provider, so you should charge them $5.75 a month for that service 😊"
    },
    {
        "comment": "It’s painful to pay $5 for nothing 🥲"
    },
    {
        "comment": "In Sweden the cost for \"having an account\" is somewhere around $60/mo, so good for you."
    },
    {
        "comment": "that 5 bucks is better than mine currently 28 bucks just to have an account"
    },
    {
        "comment": "$5.75 😂 just to have an account 😅"
    },
    {
        "comment": "My power company charges me £14 per month standing charge just to have an account. I wish it was only $5.75 😭. I don't have any air conditioning here, it rarely gets hot enough for that, but heating in the winter costs a *lot* of money."
    },
    {
        "comment": "Charging $5.75 a month to keep the account “active” has got to be some sort of illegal 😭"
    },
    {
        "comment": "Yup I had that stupid charge each month as well. Thnaks for this. Explains alot and i will share with friends who ask me that question"
    },
    {
        "comment": "You're paying for the infrastructure."
    },
    {
        "comment": "Seems like a bit of BS that you put more power into the grid by the end of the year and don't get paid for it at all... You shouldn't be getting a 5.75 monthly electricity bill, you should be getting PAID for putting in more year round than you actually use."
    },
    {
        "comment": "The $5.75 is because the electric company has infrastructure costs to take wire to his house."
    },
    {
        "comment": "My monthly fee is $26.97. I used to not be mad but now I am."
    },
    {
        "comment": "That 5 dollars subscription amount? 😂 That's almost half our electricity bill"
    },
    {
        "comment": "Isn’t your kw credit offsetting the $5.75 monthly charge?"
    },
    {
        "comment": "You got a very low service charge in the US. Here in New Zealand, it cannot get lower than $70 ($40 USD). Consider yourself lucky."
    },
    {
        "comment": "The monthly charge from the grid operator is more than fair. They’re operating the infrastructure allowing you to buy or sell power when you need to"
    },
    {
        "comment": "It's insane how they charge for power in he States. In my Caribbean country we have 1 power company and it definitely doesn't cost that much nor do you pay just for having an account"
    },
    {
        "comment": "You should not have to pay for an account for a service that your house is always going to be hooked up to? Like how did they manage to get exclusive contacts for the grid and then manage to be able to charge a fee"
    },
    {
        "comment": "That’s robbery for charging $5.75 for just an active account."
    },
    {
        "comment": "The $5.75 service charge is honestly a steal on your part. You’re getting a deal each month to use their power lines and take advantage of your excess power. If utilities are smart those fees will start to increase as more people transition to energy independence."
    },
    {
        "comment": "Charge $5 for account. Ooo America 😂😂😂😂😂😂"
    },
    {
        "comment": "I mean 5.75 to be connected to the grid in case of emergency or malfunction is actually not bad at all, it's sort of like an insurance"
    },
    {
        "comment": "Wow a whole five dollars to basically have a back up if your system malfunctions I don't know that's too steep. Of course you're also paying to maintain the infrastructure and feed your excess power to your neighbors which you probably don't like."
    },
    {
        "comment": "27:10 imo that's a justified charge even if you're backfeeding the grid. Even if you're not using power from the grid you are still using the grid itself, which is complex and requires upkeep."
    },
    {
        "comment": "Lucky you, where I live my power company charges $30 per month for the account. 5.75 sounds awesome."
    },
    {
        "comment": "$5.75... They gotta get their money one way or another...🙆‍♂"
    },
    {
        "comment": "5.75 I’d be pissed. You’re putting power to the grid, they’re supposed to cut you a check or so I thought"
    },
    {
        "comment": "5,75 just to have an account"
    },
    {
        "comment": "That $5.75 is probably the maintenance fee to keep the powerline up and running and replace it whenever it breaks. But in other places if you provide more energy to the grid, the electricity company pays you."
    },
    {
        "comment": "that 5.75 thing is crazy."
    },
    {
        "comment": "$5.75 is super cheap to have the energy provider maintain the transformers and lines to your house."
    },
    {
        "comment": "5.75 isn't bad, my service fee is 52.00"
    },
    {
        "comment": "@@marios3202 They don't charge all at the same time though. Stop the BS."
    },
    {
        "comment": "26:53 That is still a cheap service / standing charge. Expect to pay 50c/day shortly."
    },
    {
        "comment": "Basic usage charge should be much higher, to prevent poor people like myself from being stuck with paying for a electricity distribution system while the rich get away with credits lol"
    },
    {
        "comment": "And you are surprised they charge you??? Cancel your account, disconnect from the grid and you will not have to pay anything. It’s strange people like you complain about little fee, while staying connected to the grid. You want them to keep you connected for nothing???"
    },
    {
        "comment": "that $5 monthly charge though 😂they got to find a way to get a nickel from you."
    },
    {
        "comment": "That’s kinda annoying you’re paying just for having an account tbh"
    },
    {
        "comment": "That $5.75 per month might seem annoying, but I think it's actually a good idea that they're charging it. You're still using the grid, and if lots of people can opt out of paying for it at all, it becomes a real problem. Somebody has to pay for the grid's upkeep, etc., after all!"
    },
    {
        "comment": "In Canada a 1 bedroom apartment, just for me to be connected to the grid is $145 with all the fees. My actual usage with two A/C units running constantly is $77. Our carbon tax is ruthless."
    },
    {
        "comment": "Geez. $5.75 just to have an account. Just like Netflix."
    },
    {
        "comment": "Charging 5 dollars per month, while not a lot, just to “keep your account” is criminal. It’s like banks charging you because you don’t have enough money in your account."
    },
    {
        "comment": "Having a transmission charge makes sense. You’re still using the grid infrastructure and relying on it so it make sense to put a little into the upkeep. Maybe that maintenance fee is built into the kWh charge but in sense to that you pay for the grid even in the months that you don’t use it because it was always an option for you to have access to it during that month anyway."
    },
    {
        "comment": "ok, the ending made more sense, but mine is $14-15 a month, so your $5.75 is not bad. I only do not agree with you about being off the grid though, you are not, you are connected still and use it almost monthly. Your batteries allow you to not need the grid, but you are not off grid. I have had panels are 4 years, very happy with them!"
    },
    {
        "comment": "I think TechConn would be happy to pay the $5.75 for the electricity connection account."
    },
    {
        "comment": "Of course there's a 5.75 charge xD they need to get your money somehow"
    },
    {
        "comment": "Hilarious (I know he is joking) he is complaining about a $5 charge to have access to the grid in case of emergency"
    },
    {
        "comment": "*27:04** They Charged $5.75 Just To Have An Account!* 🙄"
    },
    {
        "comment": "$5.75 is cheap to have electricity available on demand 24/7 year round."
    },
    {
        "comment": "I know in some places the grid should pay you for the electricity you generate past what you use, so that 5.75 wasn’t all they took."
    },
    {
        "comment": "@@HeyItsHadesGood point …. But as you can see most of the audience here cannot see the irony of the whole thing, and … he gets to complain about 5.75$ connection fee. Some people just have no boundaries …."
    },
    {
        "comment": "That $5.75 monthly charge was the deal breaker for me."
    }
]