[
    {
        "comment": "what does that mean?@@merojeff"
    },
    {
        "comment": "That still does not add up in the real world - it’s a myth"
    },
    {
        "comment": "@@merojeff Why do you keep using acronyms like a gay nerd?"
    },
    {
        "comment": "@@theondono 👈🤡 I found that guy everyone."
    },
    {
        "comment": "​@@rycek11when the apocalypse comes, he'll be glad he did!"
    },
    {
        "comment": "​@RichardLofty thats been completely disproven"
    },
    {
        "comment": "​@@RichardLoftyThis statement is scientifically FALSE."
    },
    {
        "comment": "​@@RichardLofty Nonsense, where did you get that BS from?"
    },
    {
        "comment": "​@@kgal1298yes... they \"didn't\"....🤦‍♂️"
    },
    {
        "comment": "​@@RichardLoftyNO THEY DON'T!! Don't lie about appearing intelligent, honest & factual...!!"
    },
    {
        "comment": "​@@RichardLoftydata?"
    },
    {
        "comment": "​@@nyemartin5737not technically sell, but get credits. It was mentioned, many times."
    },
    {
        "comment": "@@JStack These people are literally living in the Matrix."
    },
    {
        "comment": "@@guidedmeditation2396your guided meditation is misguiding you"
    },
    {
        "comment": "​@@RichardLoftySimply not true. Stanford researchers investigated this very question. Are you just repeating hearsay? What's the source your assertion is based on?"
    },
    {
        "comment": "I found her profile online and reviewed her credentials. She has impressive experience. Thanks for sharing! I've already sent her an email."
    },
    {
        "comment": "@@ciaran_socal wow! 😲"
    },
    {
        "comment": "I really appreciate this @mkbhd, thank you!"
    },
    {
        "comment": "@@Elte156 ok. Thank you for clarifying"
    },
    {
        "comment": "@ urbanlinewear \"Love your city? follow me! \"🙏🙏🙏"
    },
    {
        "comment": "​@@AnonymousGUY554 I bet your parents weren't saying the same when your country got destroyed"
    },
    {
        "comment": "@@MrBobbybrady thank you brother, I appreciate your truthful words ♥️ I don't think I mind reading a hateful message from someone in a neighbouring country if that means I'm gonna read a message like yours from across the globe 😂, it's nice to see people like you!"
    },
    {
        "comment": "@@throwaway395 yep but overnight expert?"
    },
    {
        "comment": "@scottleitch2388 Yeah, just keep telling yourself that, lol"
    },
    {
        "comment": "@@JohnSmith-df2wi That's literally what happened"
    },
    {
        "comment": "You prob got a better experience than another American."
    },
    {
        "comment": "What about non Americans?"
    },
    {
        "comment": "@Azarilh by \"Americans\", I meant anyone who lives in the US, regardless of national origin."
    },
    {
        "comment": "@@IronDragonGroup What about people that live outside of USA? 🤔"
    },
    {
        "comment": "@@Azarilh I don't have the information to have much of an opinion on that, so I don't think I can comment."
    },
    {
        "comment": "@@IronDragonGroup 👍"
    },
    {
        "comment": "@@Stevepcox491 Whatever ☑️"
    },
    {
        "comment": "@@Stevepcox491 Ok, fine, 90 years."
    },
    {
        "comment": "@@Stevepcox491 OK, 45 years. Are you happy now? :)"
    },
    {
        "comment": "@charlesg5085 yep!(most of the newly built houses with new designs have them)"
    },
    {
        "comment": "​@@Hadi_Unknowndamn it's that high 😮"
    },
    {
        "comment": "@@waleedkhawaja8276he doesn’t have either of them lol"
    },
    {
        "comment": "@@JohnMcSmith i guess no country is civilized then"
    },
    {
        "comment": "@@Jake-rs9nqlmao you must not be from Texas. Shit goes out whenever it feel like it"
    },
    {
        "comment": "@@zachb4091 That is exactly correct!"
    },
    {
        "comment": "@@crcurran I'll still stick with what professionals use."
    },
    {
        "comment": "@@Den3girl they only last 20 years"
    },
    {
        "comment": "@@Dog_in_tree yeah sure. (Jfc this guy.)"
    },
    {
        "comment": "@@petersmangalisongoma2013 wow, that was a quick takedown, should tell you something"
    },
    {
        "comment": "​@@JamieReynolds89lol right? OP is just a Marques simp"
    },
    {
        "comment": "@@Avendesora or maybe you're saying you get where I'm coming from and I'm misunderstanding the direction your comment? I'm a bit tired man"
    },
    {
        "comment": "@@uncledeadhead3674 lol... love people talking without having a clue what they are talking about... lol"
    },
    {
        "comment": "@@spencerstrandholt5124 12kw and I am buying"
    },
    {
        "comment": "@@solvek2196 may just need to park outside all the time lol."
    },
    {
        "comment": "​@@ReggieK-hn1uyits just true. Facts dont care what you think."
    },
    {
        "comment": "@@theondono 100% well said bro, it's just another way to fleece money out of working families."
    },
    {
        "comment": "@billmoree8089 Where does anyone's singles go when they're at the end of life? What your point?"
    },
    {
        "comment": "@@pukes6273 your name is double cringe."
    },
    {
        "comment": "@@edwardmolloy7548 they last multiple decades. be serious"
    },
    {
        "comment": "@@p.chuckmoralesesquire3965 What? You're insulting someone's intelligence, but you can't write a proper sentence?"
    },
    {
        "comment": "@@PrincipalScratcher1middle school spelling b champion spotted :P"
    },
    {
        "comment": "@@billmoree8089 and they die every 7-10 years too!"
    },
    {
        "comment": "@@GoldtisticYT😂"
    },
    {
        "comment": "@@randompersonontheinternet8790 Plus he got a 20% discount (paid for by tax payers) when he is a rich dude"
    },
    {
        "comment": "@@abcdefghijklmnop514 you’d make more money putting that in a growth. account and just pay your bill straight up tho."
    },
    {
        "comment": "@@zjeee hahaha you are right! Good point!"
    },
    {
        "comment": "@@ZachM525 Glad people like you can write. Even tho you may not be able to do simple research everybody should hear and know you cant do that. Free speech is great."
    },
    {
        "comment": "@@awesomejimthethird AC 24/7 mostly Hot here all year long"
    },
    {
        "comment": "@@AwsBadr same, although India I feel ur pain lol"
    },
    {
        "comment": "@@hiteshadhikari i guess we are both struggling through every summer lol I wish you a bless full life 🙏🏼"
    },
    {
        "comment": "@@AwsBadr same to you my brother, lots of love from India"
    },
    {
        "comment": "@thebanned2807 so true"
    },
    {
        "comment": "@@harrychufan I grant that. But my idea is mostly to nation build over here instead of wrecking other counties and rebuilding."
    },
    {
        "comment": "what does that mean?@@merojeff"
    },
    {
        "comment": "That still does not add up in the real world - it’s a myth"
    },
    {
        "comment": "@@merojeff Why do you keep using acronyms like a gay nerd?"
    },
    {
        "comment": "@@theondono 👈🤡 I found that guy everyone."
    },
    {
        "comment": "​@@rycek11when the apocalypse comes, he'll be glad he did!"
    },
    {
        "comment": "​@RichardLofty thats been completely disproven"
    },
    {
        "comment": "​@@RichardLoftyThis statement is scientifically FALSE."
    },
    {
        "comment": "​@@RichardLofty Nonsense, where did you get that BS from?"
    },
    {
        "comment": "​@@kgal1298yes... they \"didn't\"....🤦‍♂️"
    },
    {
        "comment": "​@@RichardLoftyNO THEY DON'T!! Don't lie about appearing intelligent, honest & factual...!!"
    },
    {
        "comment": "​@@RichardLoftydata?"
    },
    {
        "comment": "​@@nyemartin5737not technically sell, but get credits. It was mentioned, many times."
    },
    {
        "comment": "@@JStack These people are literally living in the Matrix."
    },
    {
        "comment": "@@guidedmeditation2396your guided meditation is misguiding you"
    },
    {
        "comment": "​@@RichardLoftySimply not true. Stanford researchers investigated this very question. Are you just repeating hearsay? What's the source your assertion is based on?"
    },
    {
        "comment": "@@navsofour2892How so?"
    },
    {
        "comment": "​@@xcruellAmerica baby!!"
    },
    {
        "comment": "@@acutelilmint8035 lmao worst advice ever."
    },
    {
        "comment": "@@avajones97 yeah you right. you changed reality with your statement. how stupid from me to mention a fact!"
    },
    {
        "comment": "@@barnyardian22 Jup, that's how your fridge works :)"
    },
    {
        "comment": "​@@barnyardian22 mostly cold here in Florida"
    },
    {
        "comment": "@@riot2136 haha „personal experience“, thats what he is trying to look like"
    },
    {
        "comment": "@@harrison00xXx well what do you have to say about the other part of my reply?"
    },
    {
        "comment": "@@nickel36 why?"
    },
    {
        "comment": "@@davidtuer5825”Nothing is forever” very well said david; everything is temporary."
    },
    {
        "comment": "@@davidtuer5825 This is literally something that almost never happens in the US lol."
    },
    {
        "comment": "@thehookup"
    },
    {
        "comment": "@@cheesegrater2000 I gave up 10 minutes in."
    },
    {
        "comment": "Thanks for the response!@@stanley6366"
    },
    {
        "comment": "Hey @mkbhd are you a supporter of Chain Link?"
    },
    {
        "comment": "@@Spidspio Agreed!"
    },
    {
        "comment": "@@VexMage If they pay me then sure then can have excess. Otherwise not my problem."
    },
    {
        "comment": "@@RandomUser2401 Cool, congrats on not being American. Job well done."
    },
    {
        "comment": "@@zachhansen7966 it really does help a lot with life in general."
    },
    {
        "comment": "​@ERMOONSaladino5 sounds like you didn't do your research, or got caught in predatory advertising"
    },
    {
        "comment": "@@balbes1165 Humanity moves ahead despite the idiots. That is the good news."
    },
    {
        "comment": "@@ERMOONSaladino5it’s heavily depends on wear you live man"
    },
    {
        "comment": "@@Potateos Source? Yeah I didn't think so. Opinion rejected LOL."
    },
    {
        "comment": "@@MD-vk3bj Pray tell, when?"
    },
    {
        "comment": "@@fragslap5229 19:03 and onwards"
    },
    {
        "comment": "@@ERMOONSaladino5 Did you contact Customer support? what did they say?"
    },
    {
        "comment": "@@TeacherPauloPontes How, it sucks. Glad I don’t live in Brazil 😆"
    },
    {
        "comment": "@@horus6915 hahaha tell me about it man"
    },
    {
        "comment": "I bet if I enquire with your email I’d get a reply within 10 minutes"
    },
    {
        "comment": "Come from @ATC"
    },
    {
        "comment": "@@Dmwizerd I wish! I live in Brazil! 😭"
    },
    {
        "comment": "@@henriknielsen9674 Yeah did you not understand that? I can explain if you want"
    },
    {
        "comment": "@@kcutoob Let's just face it. This is entertainment. Not a real review."
    },
    {
        "comment": "@@MrMagicFreedomthat’s without heating 🤯"
    },
    {
        "comment": "@@HokageZebra for whom?"
    },
    {
        "comment": "@@super-duper i love your idea but it’s America we can build shit but we can’t share it"
    },
    {
        "comment": "@@SupaNIWA Yeah thats why I stopped watching them"
    },
    {
        "comment": "@ eskom ... If you know, you know."
    },
    {
        "comment": "@@me.0123 rounded up"
    },
    {
        "comment": "@davidwang1807 I meant medium, even a year later. Feel free to use the dictionary."
    },
    {
        "comment": "Good to know, thanks@@FlannelNZ 😊"
    },
    {
        "comment": "@@GrahamTheSolarMan wow I appreciate the reply and info!"
    },
    {
        "comment": "@@zwicker5585facts! And there are places in America that look like a 3rd world country (West Virginia/Appalachia region)"
    },
    {
        "comment": "@@nord76231 😂 the pressure was too much"
    },
    {
        "comment": "@@mencobagear5874 😂😂😂😂😂😂😂 woow I should tag my president here"
    },
    {
        "comment": "@@zwicker5585 😂 I'm glad to hear that, but still we are very far behind but my generation is working hard to bridge the gap 🤞"
    },
    {
        "comment": "@@mencobagear5874 😂😂 the unfortunate truth"
    },
    {
        "comment": "​@@arthurclery5731which makes sense because they're paying you a wholesale rate."
    },
    {
        "comment": "@@arda9310 Gotcha, makes sense. Didn't catch that part."
    },
    {
        "comment": "@@steffiejoe gotcha. But the same risk applies 😉"
    },
    {
        "comment": "@@thisnowthen You must be fun at parties."
    },
    {
        "comment": "@@Bballfan1992 Thank you!"
    },
    {
        "comment": "@@bobby4363 okay yeah that’s scummy for sure. 50k a - ouch. I never trust door to door salesmen."
    },
    {
        "comment": "@@DirtMerchant693 I didn’t even think about that, but really good point!"
    },
    {
        "comment": "​@@DirtMerchant693that's where the guaranty plan comes in bro"
    },
    {
        "comment": "@@edkaempf906 nice analysis👍"
    },
    {
        "comment": "@@Martinit0 true, he could even give his place away and still be fine with it 😁"
    },
    {
        "comment": "@@OriginalRMG Exactly. This a young people or well-off people thing."
    },
    {
        "comment": "​@@teknoid5878no you can't..."
    },
    {
        "comment": "@@pssed not in London."
    },
    {
        "comment": "​@@ceedee5103well you chose to live in texas"
    },
    {
        "comment": "​@JoeClarke-bz8nr then that's pretty good. Nice job"
    },
    {
        "comment": "@@tradingbtc3391 am americian , have traveled, can confirm small and flimsey here."
    },
    {
        "comment": "​@@ceedee5103its time folks start splitting their neighbors if that's the way their going to play it."
    },
    {
        "comment": "@@teknoid5878 Yep i was going to say that."
    },
    {
        "comment": "@@carlmathews5778hi"
    },
    {
        "comment": "@@JoeClarke-bz8nrac? In the uk? You must be loaded."
    },
    {
        "comment": "​@@scottrobinson1564this is awesome and something I'm hoping to see in the UK"
    },
    {
        "comment": "​@@JoeClarke-bz8nr10-12 what??"
    },
    {
        "comment": "@@jhinabloomingflower807🐸"
    },
    {
        "comment": "@@jhinabloomingflower807 just as long as we are not a Dumb American that's all we can hope for hay!"
    },
    {
        "comment": "@@teknoid5878no you can’t"
    },
    {
        "comment": "@@carlmathews5778why aren’t you?"
    },
    {
        "comment": "@@BrianNC81 you think 🤔"
    },
    {
        "comment": "@@patrickbeck4062 Im pretty sure ots like 1750 but maybe thats peak"
    },
    {
        "comment": "@@patrickbeck4062 yeah that could be right"
    },
    {
        "comment": "@druxpack8531 you dont even have million people to doing that 🤣🤣"
    },
    {
        "comment": "@@Solid_Fuel Their guarantee was 7%loss /year."
    },
    {
        "comment": "@@walterroux291 *somebody's"
    },
    {
        "comment": "hey I'd love to chat privately about this - live in a similar area. Care to drop an email by chance?"
    },
    {
        "comment": "​@@Masheeablewhat are you disagreeing with exactly because other than complaining about their usage amount you agreed with what they've said."
    },
    {
        "comment": "​@@Masheeable so you disagree just for the sake of disagreeing. But you really disagree with nothing. Got it. Keep being difficult for no reason lol"
    },
    {
        "comment": "​@@Zirion123there are companies who do that."
    },
    {
        "comment": "@@TeamCykelhold ah yes, blame the consumer and not the big mega corporations."
    },
    {
        "comment": "​@@Zirion123No. Just set back and marvel in the \"gas\" of the 1% and think it's all rainbows and unicorns."
    },
    {
        "comment": "​@elfrjzthe car?"
    },
    {
        "comment": "@@AnimeBeefRandoms I hate to break it to you but climate adaptation is already wasting tax payer money"
    },
    {
        "comment": "@@NickHR Socialist policy \"analysts\" are a big waste of tax payer money."
    },
    {
        "comment": "@@NickHR Let the market decide not the \"policy\" makers."
    },
    {
        "comment": "@@user-RCST nice! Thanks for letting me know!"
    },
    {
        "comment": "@@user-RCST Agreed"
    },
    {
        "comment": "@@mandirasarkar-qg9nv yep youre right and confirming my point"
    },
    {
        "comment": "@@racerex340really? Walk through life? More like scroll through youtube. It’s not that serious."
    },
    {
        "comment": "@@racerex340 right. a lot folks could do this with a team and budget."
    },
    {
        "comment": "@@maneeshas mind explaining your edit?"
    },
    {
        "comment": "​@@racerex340They're fine, don't overthink them..."
    },
    {
        "comment": "@@hiddendrifts someone else's air conditioning 🤣"
    },
    {
        "comment": "@@SpoonHurler can you rephrase that"
    },
    {
        "comment": "@@SpoonHurler i meant the \"someone else's\" part, i didn't understand what you meant by that"
    },
    {
        "comment": "@@onnomeeuwis4001 isn't it the opposite, cause he gets too hot"
    },
    {
        "comment": "@@KeenanV not by default. most that are sold her ein germany can not cool."
    },
    {
        "comment": "@@ora10053 In southern Europe as well."
    },
    {
        "comment": "@@deslow7411 I am spending 3 Mwh"
    },
    {
        "comment": "@@waltch5711 That's an insane statement and if true, why would anyone with half a brain buy into this trash?"
    },
    {
        "comment": "@@gaminggalaxy9002 Oops. right you are.. I shouldn't be doing math after midnight 😞"
    },
    {
        "comment": "​@@soulplaysgames1436Thanks!"
    },
    {
        "comment": "@@KimmoJaskari that's amazing! Thanks so much for all that information, legend :)"
    },
    {
        "comment": "@@DaveBoxBG takes longer with return. That’s why I said it."
    },
    {
        "comment": "@@TheDanEdwards our goal is to be completely off line - we are NOT there yet"
    },
    {
        "comment": "@@ImARealHumanPerson with IQs like that, I understand why revenues are down 50%."
    },
    {
        "comment": "​@@xbox70333?? Really?? Source?"
    },
    {
        "comment": "​@@Iwishiwasflyinggoes to the grid. He mentioned that."
    },
    {
        "comment": "@@ikuturso7570 makes sense why you are enjoying your saunas so much 😂"
    },
    {
        "comment": "@@unom8 hopefully some legislator who actually cares for the people will propose a bill for that"
    },
    {
        "comment": "@@terarrian6232 Not quite as good as Robert Evans from Behind the Bastards."
    },
    {
        "comment": "@@timothywelke2047that’s the company that makes those scooters and those hoverboards"
    },
    {
        "comment": "​@@ishaqgt946how is yours still working? Share the link please"
    },
    {
        "comment": "@@timothywelke2047 true 🤣"
    },
    {
        "comment": "@@terarrian6232Linus’ segues will always remain superior"
    },
    {
        "comment": "@@thisiswilson complete waste of money"
    },
    {
        "comment": "@@terarrian6232 lmao comparing it to linus xD"
    },
    {
        "comment": "​@@MelbourneMeMeI hope you are not this jealous and full of hate in real life."
    },
    {
        "comment": "​@@bradmanestar9767and what's your problem with someone spending their own money?"
    },
    {
        "comment": "@@kamila4ever Oh gosh, HAAS. Anyone with their wits about them should run screaming in the other direction."
    },
    {
        "comment": "@@thomasreese2816 Ahh, gotcha. Thank you!"
    },
    {
        "comment": "@@AlexKiritz Thanks for this :)"
    },
    {
        "comment": "​@@GMM2042No man. Below 0f maybe. 40f is still the sweet spot."
    },
    {
        "comment": "@@TheGuruStud. I’ve got a Carrier variable speed. In Florida. So far, so good."
    },
    {
        "comment": "​@@StroalOutdoorsHow cold does it get there?"
    },
    {
        "comment": "@@surajthakar2228 Thanks! I appreciate the info"
    },
    {
        "comment": "@@shawndev3901 Netherlands?"
    },
    {
        "comment": "​@@fetBlol!!!! It's not anything anyone ignore! You need money to make that possible"
    },
    {
        "comment": "Where do you live?@@shawndev3901"
    },
    {
        "comment": "@@shawndev3901 You are luckier than you know."
    },
    {
        "comment": "@@colt5189 Take it up with the federal government, leaving comments like these are pointless."
    },
    {
        "comment": "@@daneflanigan Not so much in Washington State. But it's ok for your needs I guess. To heck with the big picture."
    },
    {
        "comment": "@@YolandaPlayne so basically everywhere except \"some\" places in the USA. 🤣"
    },
    {
        "comment": "@@marios3202 Exactly right."
    },
    {
        "comment": "@@crelliseng You should try reading my entire reply."
    },
    {
        "comment": "@@ivoryas1696 TNG 👽"
    },
    {
        "comment": "@@unknownclint1740 But he is right."
    },
    {
        "comment": "@@YolandaPlayneproof?"
    },
    {
        "comment": "@@YolandaPlayne where are you getting this misinformation?"
    },
    {
        "comment": "⁠@@bitcoresbut excess storage is expensive."
    },
    {
        "comment": "​@YolandaPlayne what do you mean by a few years?"
    },
    {
        "comment": "@@p99ta he paid upfront"
    },
    {
        "comment": "@@blackrockcity exactly, well said."
    },
    {
        "comment": "@@segawalker3302 ok great but I never compared the two."
    },
    {
        "comment": "@@stevemcfarland4661 Probably likes to sit on the porch and enjoy the cool breeze...coming from the open door to his house."
    },
    {
        "comment": "@@hotdognl70 so in effect we just don't know and it's a gamble"
    },
    {
        "comment": "​@@ShaI7ow_extremely true in Florida it's going down year by year"
    },
    {
        "comment": "@@ralph04ification ok. I’ve already had this explained to me and I said ok"
    },
    {
        "comment": "@@nexusly6720 yeah, we discussed this already"
    },
    {
        "comment": "@@SemiZeroGravity yeah, or it could be less"
    },
    {
        "comment": "@@marios3202 They found that out first hand in California!"
    },
    {
        "comment": "​@@jonathannoble9194what??"
    },
    {
        "comment": "⁠@@GardenGuy1942 HELLO DEAN, THANKS FOR YOUR INPUT. ITS GOOD TO KNOW. THANK YOU, IAN"
    },
    {
        "comment": "@@GardenGuy1942 HELLO, I DISAGREE, I LIKE LONG CONTENT. THOMAS"
    },
    {
        "comment": "@@vinstinctwould love that tbh"
    },
    {
        "comment": "@@andrewk8636 Sorry, stopped reading after \"if your a\"."
    },
    {
        "comment": "@@dbavatar I’m not saying it’s a likely scenario but it is definitely something you should be aware of."
    },
    {
        "comment": "@@asht7788scary thought, it could have been ai gen an we’d never know"
    },
    {
        "comment": "@@danielthompson3928 thanks!"
    },
    {
        "comment": "@@fightzero01 that's the one!"
    },
    {
        "comment": "@@MultiLegman dang I didn’t even notice. I’ll check it out next farmers market :)"
    },
    {
        "comment": "@@ka0235 crazy right? Good job, how've you liked yours? It's been amazing for us."
    },
    {
        "comment": "@@fightzero01 please do! Would be happy to give you a tour of it 😁 love the market!"
    },
    {
        "comment": "@@TeslaMojo-Alt been thinking about doing just that!"
    },
    {
        "comment": "@@mkbhd that's cool"
    },
    {
        "comment": "​@@smgabardohe on that limitless shit fr"
    },
    {
        "comment": "@@steveno7058 you’re a good person"
    },
    {
        "comment": "@@shantanapowell7799 Agreed"
    },
    {
        "comment": "​@@EAfliesdidn't say I did, I just knew a bit of info going in"
    },
    {
        "comment": "@@TOOG007 yeah but he does it in such a neat and informative way. Absolutely the best window shopping experience on yt 😂"
    },
    {
        "comment": "@@walterparada1530 lol I agree with the second part, not the first tho"
    },
    {
        "comment": "@benjaminfenton8962 thats what we sales people be telling folks but they don't wanna listen"
    },
    {
        "comment": "@@melessemansur4647I’m also 18❤ Buh I think nowadays a lot of money can be made from the internet so…"
    },
    {
        "comment": "@@riopacheco01bkmemenEjrmA i was e S S D my muumuu u😮😮😮❤nju❤❤ 😊"
    },
    {
        "comment": "@@Genga-x8h \"just invent new technology BRO!\" 🤦‍♂"
    },
    {
        "comment": "@@mounirjamaaoui9780 based solely on his opinion? Of course not, but I trust him enough that I would defer to a review of his if I'm on the fence"
    },
    {
        "comment": "@@vapeurdepisseplease say more. Whats a better option?"
    },
    {
        "comment": "@@virtualworldsbyloffnot if your rich"
    },
    {
        "comment": "@@colt5189 That's not how taxes work bro..."
    },
    {
        "comment": "​@@DemX12hell yeah bro"
    },
    {
        "comment": "@@GLUBSCHIwhy all the hate bro?"
    },
    {
        "comment": "I am the only one that can prove it"
    },
    {
        "comment": "@bringthebridgeyou’re mad and salty that you’re late"
    },
    {
        "comment": "@@slothymangoI was here within two hours"
    },
    {
        "comment": "@@Revelation20.10 damn bro I'll give you that ticket tho"
    },
    {
        "comment": "@@reallyepicguy jk"
    },
    {
        "comment": "@@reallyepicguy don’t care"
    },
    {
        "comment": "@@Richey24 claimed"
    },
    {
        "comment": "​@@slothymango what the fuck dude 😂"
    },
    {
        "comment": "@@Clifton8209 what?"
    },
    {
        "comment": "@@somerandomperson4143 I tried to warn everyone"
    }
]