[
    {
        "comment": "April showers bring May flowers, after all"
    },
    {
        "comment": "Also in May your air condition is probably off."
    },
    {
        "comment": "I guess they need to change the rhyme to \"April showers bring May solar power\""
    },
    {
        "comment": "I guess spring, also gives more energy since you don't use AC as much."
    },
    {
        "comment": "So definitely set your order up to start in the may or just before so you get enough net negative to last through the winter."
    },
    {
        "comment": "it may be the best month."
    },
    {
        "comment": "May has similar day length as July so no surprises"
    },
    {
        "comment": "Do a 2 year review! We had a lot more summer this year ! Also high temps lowers the energy production !"
    },
    {
        "comment": "13:12 Solar panels also become much more efficient when they run cold. While the summer sun might have more energy, it heats up the panels significantly which causes inefficiency."
    },
    {
        "comment": "Solar generation is higher in may than june-july-august also because solar panels don't like running too hot. So the extra sunlight you get is compensated by panel getting hotter and overall the output power decreases a bit"
    },
    {
        "comment": "Hahaa I totally guessed may!"
    },
    {
        "comment": "There are solar panel fans that help maintain optimal temperature"
    },
    {
        "comment": "It would make sense for me here in the deep south where we have plenty of sun, enough rain to keep the panels clean, and have the highest need for power during the summer to run a/c and rarely need the heat."
    },
    {
        "comment": "Another reason May is a really good month for solar is photovoltaic cells are most efficient at 77 F panel temp, and since they are in the sun on the days where efficiency matters the most they'll be a lot hotter than the air temperature, so cooler days with lots of sun are best."
    },
    {
        "comment": "May should produce the most energy!"
    },
    {
        "comment": "Another thing to take in account, i have solar panels :) When it's colder, they make more electricity. I can make 5KW, but i've never seen it during summer, only when it's colder :)"
    },
    {
        "comment": "16:52 *hint “April showers bring May flowers”"
    },
    {
        "comment": "Fun fact as to why your solar roof performs better in the spring: Just like batteries, solar panels also have a preferred temperature they operate at. The efficiency of solar panels is highest at 25 degrees Celsius (77F). When the Sun shines on the panels they might warm up beyond the ambient temperature, and in the summer this means that the performance and thus the yield is reduced. Whereas in spring the more moderate temperatures and sunny days mean that your panels at working at peak efficiency!"
    },
    {
        "comment": "Wrong!!! the deeper the temperature the more efficient are the panels ! a cold morning in spring may even bring higher output than the named maximum !"
    },
    {
        "comment": "Springtime is the best time for my solar system because little to no HVAC use and the days getting longer."
    },
    {
        "comment": "The earth is closest to the sun in March, we have an eccentric orbit. This will effect the amount of solar radiation received along with daylight hours and clear skies."
    },
    {
        "comment": "May is the best month because of temperature coefficients"
    },
    {
        "comment": "April showers brings May net negative grid days"
    },
    {
        "comment": "Solar panels run at a higher voltage in cooler temperature. Also eight sleep is amazing."
    },
    {
        "comment": "The reason may was your best is because of your temp coefficient of the module/cells. They like cold temps this less resistance and flows."
    },
    {
        "comment": "Oh and, the hotter the panels become in summer, you loose some efficiency. Might be another reason why early summer and early fall might be better for solar."
    },
    {
        "comment": "The reason May's production was highest is that solar works better in lower temperatures."
    },
    {
        "comment": "Solar panels produce more when they are cool, so fall is a great time to get solar power"
    },
    {
        "comment": "May is when the flowers usually start to bloom due to more sunlight"
    },
    {
        "comment": "April showers bring May flowers, after all"
    },
    {
        "comment": "I mean...Isn't that obvious? 100 m^2 is better than 10 m^2 and the more sunny days you have the more energy you produce?"
    },
    {
        "comment": "Solar panels don't work effectively when it's really really warm outside.They work best when it's somewhat warm with a lot of sun. Like spring."
    },
    {
        "comment": "It’s nice to see someone reviewing these in a climate that would be similar to where I live. I guessed May right away as your best month."
    },
    {
        "comment": "In theory, Spring season should generate more electricity. The reason for this is that solar panels work less the warmer they get."
    },
    {
        "comment": "Very common misconception. Days don't get longer in the summer. Longest day of the year is the solstice which is the first day of summer. So it makes sense that the 2 months leading into summer would net better than the 2 months into summer (ignoring storms) as light is about the same but HVAC runs a lot less leading into summer"
    },
    {
        "comment": "Keep in mind that solar panels, just like batteries also have a optimal temperature range where they generate most energy. Hence Spring is very beneficial ;)"
    },
    {
        "comment": "They do not work well when outdoor temps are below freezing.. they actually function like a giant space heater when it get really cold and become extremely inefficient. But amazing for spring and fall! Had to throw this out there because my first year experience with one I saw a $700 electric bill in February. Usually $180."
    },
    {
        "comment": "May is awesome for not using heater or AC"
    },
    {
        "comment": "The reason may was more productive was the lower ambient temperature. So your solar panels were more efficient."
    },
    {
        "comment": "May peak generation for me in Arizona as well. Probably more to do with the Sun impinging angle to my panels."
    },
    {
        "comment": "spring is when plants like to grow for a reason my guy ..... learn some solar intake timing from their collective wisdom."
    },
    {
        "comment": "We had a very abnormal May and June weather wise in New Jersey. My guess would be that in an average year, June will be your best Month. May and June were essentially switched this year as far as weather"
    },
    {
        "comment": "LOL! you said to guess which month you generated the most. and I immediately said May. But I live in Montana. so our springs are similar"
    },
    {
        "comment": "Most solar power happens at spring because the panels have the most output at 22c."
    },
    {
        "comment": "There's a reason why it's named Mayweather 😊."
    },
    {
        "comment": "May is the best month out of the year PERIOD."
    },
    {
        "comment": "May could also be higher than June and July because the weather is cooler. Once the temperature gets really hot solar panels make less energy. May might be the sweet spot in solar hours and temperature."
    },
    {
        "comment": "April showers bring May flowers is pretty accurate then :)"
    },
    {
        "comment": "Great video! Super informative! Thanks. Just one thing about what you noticed about May being the best month…I live in the area and it was the driest (aka cloud free) month in history for this region. We got less than .25” of rain for all of may. Your draw next may will probably be very different. But still super useful numbers dude! 👍🏻"
    },
    {
        "comment": "The temperature coefficient is inversely proportional to the power generated from a solar panel. That can also be the reason why spring has more generation than in summer months."
    },
    {
        "comment": "I don't know if you noticed, but you can actually convert some of the energy you produce during summer into a physical fuel to be used on a cloudy day."
    },
    {
        "comment": "Nice I said May would be the best month"
    },
    {
        "comment": "Also, panels lose efficiency at higher temperatures."
    },
    {
        "comment": "Panels, batteries, etc, are also super happy in pleasant Spring temps. You're using much less electricity to cool/heat in the Spring and electrical equipment is at peak efficiency."
    },
    {
        "comment": "Heat reduces panel output. This is why May is the most efficient month for panels, because it's maximum sun without maximum heat."
    },
    {
        "comment": "@Marques Brownlee Thank you soo much for all the information, something to add is that the more perpendicular the solar panels are to the sun the more the panels will generate so the ratings the solar manufacture provided are correct, additionally photovoltaic panels use light energy from the sun and not the heat so ironically more heat makes them less efficient and more light makes them more efficient so you need them to dissipate the heat as quickly as possible. You can research solar trackers to get a better idea."
    },
    {
        "comment": "Fun thing is that my solar panels generate more energy on cooler days. Solar inventers tend to work better when its not that hot on a particular day."
    },
    {
        "comment": "Yep, I run solar at home, and May is the best month I get. The main reason for that is that the air is still cooler (compared to June/July/August) so the panels run at optimal performance. Solar panels do not like getting too hot, which is a bit of a silly thing. So in May there's plenty of sun, and the air is cooler. In July there's lots of sun but the panels are overheating all the time and are producing less."
    },
    {
        "comment": "Turns out May is very typically the best production month even though June is typically the most sunshine. Why? Temperature. Heat reduces efficiency in every electrical circuit (including solar cells), so the hotter your roof gets, the worse the efficiency of your solar system."
    },
    {
        "comment": "43x330 watt (14.2kwh) panels solar without batteries. net metered. Vegas area. May is also the best month of the year. June has too many cloudy monsoon days."
    },
    {
        "comment": "Did you KNOW that when solar panels get to warm they produce significantly less..... could explain why spring produces such good numbers"
    },
    {
        "comment": "16:29 i got it right i said May hehe"
    },
    {
        "comment": "April and May are good because solar like to operate between 20-25 degrees Celsius an despite the fact that in July and August you will have more sun you will also have higher temperature and it is too hot for solar thus they produce less energy. Mkbhd if you have excess of power you can install heat pump to heat your home :)"
    },
    {
        "comment": "Interesting info: Solar panels actually are more efficient in cold temperatures, you won't perceive it because the overall sunlight input is considerably lower than in summer."
    },
    {
        "comment": "April showers bring May positive solar surges... thats how that goes right?"
    },
    {
        "comment": "The main reason you generate the most electricity in May is because you get full sunshine AND the temperatures are not that hot.. If the temperatures of the solar cells are above certain levels the efficiency is lower.. The ideal circumstance would be 25 degrees celsius of the cell and full sunshine"
    },
    {
        "comment": "16:40 May?!?!? And I always thought the prefect date was April 25th."
    },
    {
        "comment": "The reason why you have more solar power in may. Is because temperture is low and then sun is there a lot. So how colder the panels (solar cells) are the more they generate. In the summer yes there is much more sun, but more heat. What excuals to a lot of power but less production in total. April and May will be the best months, but it all depends per year how many solar hours you get. Noice system"
    },
    {
        "comment": "I tend to generate a lot more solar energy in Spring because the trees around our house don't have leaves yet."
    },
    {
        "comment": "One thing to note, the sun might have much more power in the summer but the solar tiles heat up and are not as efficient anymore as they might be in spring when there is also a lot of sun but with milder temperatures which makes the solar systems much more efficient. Same applies to the battery of your car which operates best at around 70 to 80 degrees but if the summer days are too hot then the batteries are not as efficient anymore."
    },
    {
        "comment": "If the panel wattage is oversized compared to the inverters (which is the norm in Australia at least), you're probably not going to notice. For instance my system is 10.3kw of panels and 8.3kw of inverter capacity. Any decrease in efficiency during heatwaves doesn't translate into a noticible effect."
    },
    {
        "comment": "It also probably has to do with which month his house hits the sun the best."
    },
    {
        "comment": "May was also your best month because solar actually works better when the outside temperatures are cooler."
    },
    {
        "comment": "May is the best month for my solar system as well (Moldova, Eastern Europe). Solar panels, as well as solar roof, \"like\" cold sunny weather - they perform better when outside is cold, in Summer, even if the days are longer but much warmer, solar panels do not produce so much electricity because they overheat."
    },
    {
        "comment": "One other reason your energy production peaked in May instead of the summer: solar panels become less efficient when they get hotter. So in peak summer they may collect less energy from the same sun-hours than in spring. Nonetheless a very interesting video!"
    },
    {
        "comment": "Hey Marques! Thanks for the great video and explanation as always. Power R&D engineer here; I'm curious about any increase in efficiency of solar panels in colder months. Lower electron rest-levels at lower temperatures produce larger outputs per photon (could be up to 20% iirc!). This could explain the better overall performance in the spring (sunshine-temperature sweet-spot). Perhaps this can be confirmed by plotting outside temperatures on the same graph? Thanks again, lemme know what you think, and keep acing these videos :)"
    },
    {
        "comment": "The optimal month highly depends on your roof angle."
    },
    {
        "comment": "The summer solstice happens in june although july is a summer month so what would be expected to happen is a greater solar power production in june but as happens in mid june the solstice, may is like in the rear view mirror so the peak production may well happen in may , it will depend on lucky to have sunny days or not . Another thing that counts is that on high latitude places like New Jersey the sun rays are always tilted southward even around the midday so depending on your roof geometry and location the months around the solstice, i mean may to July , can actually have almost the same solar intensity because when your roof is tilted southward on its majority matching the sun rays direction the incidence will be high even on the early hours of the day because as you know due to the right ascension of the sun the solar rays are changing its direction every hour and the solar incidence lowers when the solar rays are too different of the roof’s inclination deflecting the majority of it."
    },
    {
        "comment": "The real reason May is the highest solar production month is because it's the best operating conditions for solar panels. When it's too hot out the efficiency gets worse."
    },
    {
        "comment": "May is also better from June because phev tiles are loosing their efficiency when their temperature is high. Somehow they should find a way to cool them down and use this excess energy back."
    },
    {
        "comment": "PV Panels (Solar is Warming Water... - and it's called Aluminium) are most efficient in end of April and in May and up to June - as the Temperatures are lower in than in Summer. PV Panels loose efficiency the higher the temperature gets. Most Panes are peak performing in around 40-45°C (Surface temperature)"
    },
    {
        "comment": "would be curious to know how your power output is on summer day with cool, cloud free wind from Canada compared to a hot summer day. because solar panels are more efficient at cooler temperatures."
    },
    {
        "comment": "Solar panels are also more efficient when it is cooler, that's why you'll generate more energy during spring."
    },
    {
        "comment": "16:29 I would have absolutely guessed April, May or June. Electronics don’t like heat and June 20th the the longest day of the year, so these effects lead to April-June being the best months for solar. March, July and August should also be kind of good. September and October get really cloudy and rainy and also dirty with all the leaves blowing around. In Germany we also use a lot of wind energy, so our electricity is cheap until November/early December with all the autumn storms. Autumn (I guess some call it Fall) is known for its strong winds (kids let their kites fly). But Germany, which is mostly north of the 50th parallel is pretty much f*ed from December to March. We used to burn Russian gas through turbines to produce energy, but that plan went to the toilet with Russias invasion of Ukraine (Also some of our supposed friends blew up our infrastructure, so that doesn’t help either; I am of course in complete support of Ukraine nonetheless). Plugging the chord on our nuclear plants was decided 2012, it was not possible to buy any new nuclear fuel (most of it is produced in Russia), so we just prolonged their run time till March and now we basically just have dirty coal for the next winter or extremely expensive LNG. We fought harder for renewables than any other country and now we are still completely f*ed over, that’s extremely depressing."
    },
    {
        "comment": "Production is best durring Spring on all solar panels, becouse day is longer, sun is operating and also air is colder so panels get additional cooling. So best months are April/May becouse sun is up, day is longer than durring winter but as mentioned air is still cold so better cooling of the panels compared to summer when they are overheating (you also are hot becouse you use AC to cool down) therefore they produce less. I have 10kW of solar power installed and there was a day in summer where suddenly cold air jumped in so the air temp dropped to 10-15C and since the day was long it wooped above 80kW in production when average is 60-65kW"
    },
    {
        "comment": "Wrong. Heat leads to inefficiency in solar power. That's why he generated more power during Spring instead of Summer. On Indian summer, solar would generate even lower power"
    },
    {
        "comment": "Spring is the best for solar energy cuz its sunny with less heat solar panels struggle in hot temp"
    },
    {
        "comment": "It’s also the temperature in May. The solar works better when it’s less hot, with panels producing more."
    },
    {
        "comment": "another thing to add about may is that when the temperature is cooler and has a bunch of uv exposure the panels are more efficient at collecting power then say the same uv exposure in july or august. cooler temps produce more voltage i think its like .5% as degree if i remember right from class"
    },
    {
        "comment": "Super interesting! The reason why May in the best month for solar production is not only for storms, but temperature, as solar panels overheat they produce less, may is the best compromise between temperature and sun position, July and August have better sun position and more light hours, but the higher temperatures are limiting the productive capabilities of your solar array!"
    },
    {
        "comment": "May was an abnormally dry sunny month in northeast."
    },
    {
        "comment": "Couple of points to add. Solar panels are significantly more efficient at lower temperatures, Therefore you will harvest more energy with less sun when the ambient temperature is lower, hence why, may was your best month. You have significantly increased the value and sellability of your property. If you want the most bang for your buck for hot water, heating , look at solar thermal system. Have a look into heat pumps. Mitsubishi make hybrid system, so you can still keep your gas furnace as a backup."
    },
    {
        "comment": "the other thing about may is its cooler out . solar panels are more efficient when they are cool"
    },
    {
        "comment": "spring is by far the best season if you think about it, the combination of sunny days and warm temperature is on point."
    },
    {
        "comment": "Solar doesn't like much heat, that's also why may is perfect for solar. Your efficiency drops when it gets to warm."
    },
    {
        "comment": "Did you have it last summer? Because this summer is just extra miserable 😅"
    },
    {
        "comment": "@SuperBabe I can get double the energy you get, because Florida sun shine is brighter"
    },
    {
        "comment": "16:32 Another reason why the panels generate more energy in spring, is that they run cooler and therefore are more efficient than in summer."
    },
    {
        "comment": "Awesome video as always! I would have loved to watch this while researching my solar. One thing you missed: part of the reason why your production is the best in May is because despite the extra sunlight hours in the summer, solar panels lose up to ~15% efficiency under extreme heat. You’ll notice that the best production days are those days closest to the summer solstice, when you get a freak cooler day. But otherwise for sure the best days are in April and May."
    },
    {
        "comment": "One aditional thing to take into consideration is heat on the panels. Solar panels produce much less when they overheat and that's more likely in peak summer. For me in central europe may is usually the best month as well due to combination of less heat on the panels and less thunderstorms compared to june/july"
    },
    {
        "comment": "You think in May the temperature isn't as hot as summer, so the panels can operate at optimal performance"
    },
    {
        "comment": "For spring, you switched from iPhone to Android. Why, more energy?"
    },
    {
        "comment": "Having the same experience too, I was also told that the sunnier and cooler months are better just because the efficiency of the panels is worse in the heat."
    },
    {
        "comment": "Good explanation. One small detail about the most efficient month is that the solar cells are more efficient when cold."
    },
    {
        "comment": "MAY IS THE NEW JUNE"
    },
    {
        "comment": "It's funny that you generated the most energy in may. The first thing that came to my head was \"April showers bring May flowers\". So obviously may should have the most sun That's so cool."
    },
    {
        "comment": "I'm not surprised by the May thing. In a lot of countries that are closer to the equator that is considered peak Summer."
    },
    {
        "comment": "I’m just to the north a bit in Connecticut and recently bought a house that included leased panels from Sunrun. As soon as you asked “Which month do you think generated the most?” I said “May” because I’ve seen the exact same thing the past two years."
    },
    {
        "comment": "I design solar systems at my work and May is actually the month with the most production for most of the northern hemisphere (according to software, but it also is on my own solar system)"
    },
    {
        "comment": "you miss one point that one of the main factor for the maximum production of solar power in the month of may is temperatures, the higher the temperature the lesser production of energy and vice versa, the ideal temp for solar panels is arround 25 degree centigrade."
    },
    {
        "comment": "Solar panels are more efficient when it is cold. One more reason why may might be better than peak sommer."
    },
    {
        "comment": "A lot of people don’t realize that the surface temperature of the tiles/panels effects their productivity as well. For me in FL I get way less productivity (kWh) during August even though it relatively the same conditions as May other than temperature"
    },
    {
        "comment": "from July to July gives a distorted picture. a good comparison is from 1 January to 31 December. then there are more months with little sun, so more use of purchased energy, and fewer sun months. is the story still true?"
    },
    {
        "comment": "I'm in the middle of the video, where you talk about how may was your biggest net positive month. I am a meteorologist, and may 2023 in much of the northeast was either the sunniest may, or one of the sunniest mays on record. Also, this winter was a pretty warm winter overall for most of the US, so be prepared for most winters to be worse energy-wise (maybe not this winter though, a strong El Nino is forming, which tends to have relatively warm winters), than the previous."
    },
    {
        "comment": "May makes sense as the most solar collected. Note that it’s SOLAR COLLECTED, not “sunniest month”. If he wanted to collect the most solar on the longest, sunniest day, his panels should be less steeply angled. More information, solar panels are best angled at the same angle as the house’s latitude. So, you’ll optimizing your collection of solar in New Jersey if your panels are at a 40 degree angle, which will most likely occur for the longest times between March (cloudy) and May (sunny)."
    },
    {
        "comment": "Also in May you get more power because the panel temp is lower"
    },
    {
        "comment": "is the spike in May generation have anythng to do with the angle of the sun to your roof tiles maybe? hard to imagine how it is more sunny in May than the longer bright days in Summer so there are other factors of sun exposure in different months due to Earth angle yea?"
    },
    {
        "comment": "The other thing about your generation during May is that it’s cooler than summer so your panels are more efficient. Maximum sun with less heat."
    },
    {
        "comment": "May this year was my best month ever"
    },
    {
        "comment": "Thats ironic. I generate more solar power in May as well"
    },
    {
        "comment": "may has such a powerful sun. “bring may flowers” 😂"
    },
    {
        "comment": "Not sure how the Tesla Panels work, but generally solar panels generate more energy in spring/fall because they're more efficient at lower temperature. When it's really hot, they produce less peak. So really sunny, but cold days tend to be the most efficient for solar."
    },
    {
        "comment": "Generating excess in the spring/fall makes sense, because you run the ac in the summer and heat in the winter, but wouldn’t it take less energy to keep the temp controlled in milder months?"
    },
    {
        "comment": "An also temperature on the solar cells. In Spring you get almost the same UV index but the tiles are cooler so you get less losses. I want a system like this one. Damn what a dream! I have solar panels but nothing close to this! he he Switch heating to a heat pump, I bet on the US there is also tax credits."
    },
    {
        "comment": "You generate more when panels are cooler, so peak summer months will generate less"
    },
    {
        "comment": "One thing worth mentioning as well, solar panels work better in colder temperatures. So May is the ideal amount of sun and temperature. (For this side of the world anyway)"
    },
    {
        "comment": "something not often mentioned is solar panels are less efficient when the temperature is high, not sure how that would affect the summer ->fall profitability"
    },
    {
        "comment": "May is my best month also."
    },
    {
        "comment": "In may you also produced more energy because it’s sunny but it’s colder so panels are more efficient than in hot summer months"
    },
    {
        "comment": "Just a note for those interested. Even solar panels run at optimum temperature. They don't like too much heat either, I guess its about conductivity? Not sure. Hence July/August doesnt need to be the best month, it's usually (northern hemisphere) the spring months of Mai / June that have the highest yield per sunny hour. The temperature is optimal and the sun is already quite high and long on the sky."
    },
    {
        "comment": "April's shower brings May's flowers. So, May are meant to be sunny."
    },
    {
        "comment": "As an energy engineer familiar with these terms and concepts, I must say your explanations using animation are super spot on. It's impressive to guess what the next thing you'll say is, and then you match it with incredible animations. Also, the reason why May gives the best output is because the efficiency of these panels drops beyond a certain temperature limit. Thumbs up to you Marques."
    },
    {
        "comment": "I've heard some solar panels work better when it's colder - is that true?"
    },
    {
        "comment": "@@hiddendrifts solar panels need as much sunlight to work... the colder it is the fastest they work"
    },
    {
        "comment": "@@hiddendrifts oh lol I was kind of joking... I don't know how that works either but if you have to provide your own energy for the cooling you'll lose out. But, in agrivoltiacs ( using solar panels as shade for plants that need less than direct light) the evaporation can help keep a longer temperature. Not significantly but anything is better than nothing."
    },
    {
        "comment": "Solar panels don't like heat so they work better when it's not hot but sunny, so that was the reason that May was the best month"
    },
    {
        "comment": "best month of year is not in middle of summer also because of lower temperature... temperature affects A LOT panel's / tiles' performance"
    },
    {
        "comment": "@16:35 silly humans, plants already figured this out millions of years ago. There's a reason they say april showers bring may flowers."
    },
    {
        "comment": "Another reason why you produced more energy in May is due to the temperature coefficient. Basically at high temperatures (above 40C) the panels produce less power even given the same irradiation."
    },
    {
        "comment": "this is crazy…i installed my solar system middle of January 2023 and May has been my best generation month on a completely different continent. and yes i had thought July was going to be my best month"
    },
    {
        "comment": "Yep, I guessed May would be the best month for solar....because that's when my electricity electricity bill and gas bill are both low at the same time and it's quite sunny."
    },
    {
        "comment": "Hey marques, Just wanted to point out another thing regarding most amount of production in May, the efficiency of these solar panels also depends on temperature. If temp. Increases beyond a certain limit their efficiency goes down. So, if its like sunny days of june and july where the temperature is very high, the efficiency of these panels goes down a little bit. Thats why in May it is producing the max as the temp. is just about right. As always great video."
    },
    {
        "comment": "may is also way colder. solar panels dont like to be hot. this is a big factor."
    },
    {
        "comment": "Thanks for sharing: May 2023 has the most sunshine, but June is typically the most sunny month of Summer."
    },
    {
        "comment": "Why Spring is better than Summer: Solar Panels are much more efficient when they are cooler as when they are hot. And in the summer they get reaaally hot and cant produce as much per sun energy equivalent"
    },
    {
        "comment": "Spring sun is the most intense even if the temperatures are still cold. I get a worse sunburn working outdoors in April and May than I do in the summer. Edit: Add a wind turbine to make more electricity when the storm clouds cover the sun and also at night."
    },
    {
        "comment": "I've seen that solar panels are more efficient if they are not hot, so spring was ideal"
    },
    {
        "comment": "But what's with February, March and April?"
    },
    {
        "comment": "The reason you’re generating more power in may is because the angle of your roof is at a greater verticality to the sun compared to what you have in the summer."
    },
    {
        "comment": "More sun in spring is mother Earth taking care of itself. The earth needs sun to help new plants grow after the winter."
    },
    {
        "comment": "Something you didn't mention that not many people know, but panels are less efficient when they're hot. Probably the main reason spring is better than summer."
    },
    {
        "comment": "Marques just FYI another reason why you don’t capture as much energy during summer is because the Earth isn’t at a constant distance from the sun, during summer Earth is at it’s furthest from the sun which means that even though you get more hours of light you don’t get the same amount of energy per unit of area"
    },
    {
        "comment": "16:35 (Stops video before you say the answer): I’m going to guess “May” because of the rhyme “April showers bring May flowers”. (Which is not an accurate rhyme where I currently live, but I know it is often accurate in the area where you live, lol.)"
    },
    {
        "comment": "I assume the heat of the summer decreases the efficiency of the solar panels? Possibly the reason that May was so much higher."
    },
    {
        "comment": "Ccone on April showers bring may flowers of course may has the most sun."
    },
    {
        "comment": "Spring makes sense. Solar is most effective with low temp and lots of sun. Its very possible places like Hawaii and Cali could go full solar. Its also why hot deserts aren't necessarily the greatest for solar."
    },
    {
        "comment": "Knew May was your best month. “April showers bring May flowers.” Thank you to my Elementary School. 16:35"
    },
    {
        "comment": "I works guess March, it always seems really sunny and clear in March"
    }
]